{
  "vocabulary": [
    "01HelloWorld",
    "void",
    "setup",
    "(",
    ")",
    "{",
    "pinMode",
    "2",
    ",",
    "OUTPUT",
    ";",
    "}",
    "loop",
    "digitalWrite",
    "HIGH",
    "02BlynkBlink",
    "#define",
    "BLYNK",
    "_",
    "PRINT",
    "Serial",
    "#include",
    "<",
    "ESP8266WiFi.h",
    ">",
    "BlynkSimpleEsp8266.h",
    "char",
    "auth[]",
    "=",
    "\"c3102448027d494ca48b27d0a732f245\"",
    "ssid[]",
    "\"ssid\"",
    "pass[]",
    "\"psssword\"",
    "Serial.begin",
    "9600",
    "Blynk.begin",
    "auth",
    "ssid",
    "pass",
    "Blynk.run",
    "03GetData",
    "\"2a365b624c0f4ea891256d4a66d428f7\"",
    "WRITE",
    "V1",
    "int",
    "pinValue",
    "param.asInt",
    "Serial.print",
    "\"V1",
    "Slider",
    "value",
    "is:",
    "\"",
    "Serial.println",
    "04PushData",
    "BlynkTimer",
    "timer",
    "myTimerEvent",
    "Blynk.virtualWrite",
    "V5",
    "millis",
    "/",
    "1000",
    "timer.setInterval",
    "1000L",
    "timer.run",
    "ATtiny85",
    "SoftwareSerial.h",
    "SoftwareSerial",
    "DebugSerial",
    "1",
    "SwSerial",
    "3",
    "4",
    "BlynkSimpleStream.h",
    "\"YourAuthToken\"",
    "DebugSerial.begin",
    "SwSerial.begin",
    "Adafruit",
    "Feather",
    "M0",
    "WiFi",
    "WiFi101.h",
    "BlynkSimpleWiFiShield101.h",
    "\"YourNetworkName\"",
    "\"YourPassword\"",
    "WiFi.setPins",
    "8",
    "7",
    "Arduino",
    "Ethernet",
    "SPI.h",
    "Ethernet.h",
    "const",
    "*",
    "host",
    "\"blynk",
    "-",
    "cloud.com\"",
    "unsigned",
    "port",
    "8080",
    "byte",
    "mac[]",
    "0xDE",
    "0xAD",
    "0xBE",
    "0xEF",
    "0xFE",
    "0xED",
    "EthernetClient",
    "client",
    "W5100",
    "CS",
    "10",
    "SDCARD",
    "connectNetwork",
    "\"Connecting",
    "to",
    "Ethernet...\"",
    "if",
    "Ethernet.begin",
    "mac",
    "0",
    "\"Failed",
    "configure",
    "using",
    "DHCP\"",
    "while",
    "true",
    "delay",
    "\"Ethernet",
    "connected\"",
    "bool",
    "httpRequest",
    "String",
    "&",
    "method",
    "request",
    "response",
    "F",
    "\":\"",
    "\"...",
    "client.connect",
    "\"OK\"",
    "else",
    "\"failed\"",
    "return",
    "false",
    "client.print",
    "client.println",
    "HTTP",
    "1.1\"",
    "\"Host:",
    "\"Connection:",
    "close\"",
    "request.length",
    "\"Content",
    "Type:",
    "application",
    "json\"",
    "Length:",
    "timeout",
    "+",
    "5000",
    "client.available",
    "Client",
    "Timeout",
    "!",
    "client.stop",
    "contentLength",
    "line",
    "client.readStringUntil",
    "'\\n'",
    "line.trim",
    "line.toLowerCase",
    "line.startsWith",
    "\"content",
    "length:\"",
    "line.substring",
    "line.lastIndexOf",
    "':'",
    ".toInt",
    "line.length",
    "break",
    "\"\"",
    "response.reserve",
    "response.length",
    "client.connected",
    "c",
    "client.read",
    "long",
    "\"Sending",
    "value:",
    "putData",
    "\"[\\\"\"",
    "\"\\\"]\"",
    "\"PUT",
    "update",
    "V2\"",
    "\"WARNING:",
    "\"Reading",
    "value\"",
    "\"GET",
    "get",
    "\"Value",
    "from",
    "server:",
    "\"Setting",
    "property\"",
    "V2",
    "?",
    "label",
    "30000L",
    "GSM",
    "GSM.h",
    "PINNUMBER",
    "GPRS",
    "APN",
    "\"GPRS",
    "APN\"",
    "LOGIN",
    "\"login\"",
    "PASSWORD",
    "\"password\"",
    "GSMClient",
    "gprs",
    "gsmAccess",
    "GSM...\"",
    "status",
    "gsmAccess.begin",
    "READY",
    "gprs.attachGPRS",
    "\".\"",
    "\"GSM",
    "MKR1000",
    "BlynkSimpleMKR1000.h",
    "MKR1010",
    "WiFiNINA.h",
    "BlynkSimpleWiFiNINA.h",
    "USB",
    "Shield",
    "WiFi.h",
    "BlynkSimpleWifi.h",
    "101",
    "Yun",
    "Bridge.h",
    "BlynkSimpleYun.h",
    "Zero",
    "SerialUSB",
    "SerialUSB.begin",
    "org",
    "UNO",
    "WiFiLink.h",
    "BlynkSimpleWiFiLink.h",
    "Blue",
    "Pill",
    "STM32F103C",
    "Serial1",
    "Serial1.begin",
    "CC3000",
    "ADAFRUIT",
    "IRQ",
    "VBAT",
    "5",
    "CC3000.h",
    "BlynkSimpleCC3000.h",
    "wifi",
    "sec",
    "WLAN",
    "SEC",
    "WPA2",
    "Digistump",
    "Digispark",
    "#if",
    "defined",
    "ARDUINO",
    "AVR",
    "DIGISPARKPRO",
    "NO",
    "INFO",
    "BUILTIN",
    "#endif",
    "DigiCDC.h",
    "Oak",
    "Blynk.config",
    "ESP32",
    "WiFiClient.h",
    "BlynkSimpleEsp32.h",
    "SSL",
    "WiFiClientSecure.h",
    "BlynkSimpleEsp32",
    "SSL.h",
    "ESP8266",
    "\"YourWiFi\"",
    "WiFiClient",
    "WiFi.begin",
    "WiFi.status",
    "WL",
    "CONNECTED",
    "500",
    "\"WiFi",
    "Lib.h",
    "BlynkSimpleShieldEsp8266.h",
    "EspSerial",
    "BAUD",
    "115200",
    "EspSerial.begin",
    "Standalone",
    "Manual",
    "IP",
    "arduino",
    "0xBA",
    "IPAddress",
    "device",
    "ip",
    "192",
    "168",
    "80",
    "dns",
    "gateway",
    "subnet",
    "mask",
    "255",
    "WiFi.config",
    "Blynk.connect",
    "BlynkSimpleEsp8266",
    "SmartConfig",
    "WiFi.mode",
    "WIFI",
    "STA",
    "cnt",
    "WiFi.beginSmartConfig",
    "WiFi.smartConfigDone",
    "\"SmartConfig:",
    "Success\"",
    "|",
    "WiFi.printDiag",
    "Energia",
    "BlynkSimpleEnergiaWiFi.h",
    "Fishino",
    "Fishino.h",
    "BlynkSimpleFishino.h",
    "Intel",
    "Edison",
    "BlynkSimpleIntelEdisonWiFi.h",
    "LinkItONE",
    "LWiFi.h",
    "LWiFiClient.h",
    "BlynkSimpleLinkItONE.h",
    "LWIFI",
    "WPA",
    "NodeMCU",
    "RN",
    "XV",
    "WiFly",
    "WiFlyHQ.h",
    "BlynkSimpleWiFly.h",
    "WiFlySerial",
    "wifly",
    "WiFlySerial.begin",
    "wifly.begin",
    "FATAL",
    "start",
    "wifly\"",
    "RedBear",
    "Duo",
    "BlynkSimpleRedBear",
    "Duo.h",
    "SYSTEM",
    "MODE",
    "MANUAL",
    "WiFi.on",
    "WiFi.setCredentials",
    "WiFi.connect",
    "SIM800",
    "SIM900",
    "\"YourAPN\"",
    "USER",
    "Stream",
    "stream",
    "gprsInit",
    "gprsConnect",
    "gprsDisconnect",
    "3000",
    "\"GET\"",
    "\"Waiting",
    "minute...\"",
    "60000L",
    "typedef",
    "FlashStringHelper",
    "GsmConstStr",
    "sendAT",
    "cmd",
    "print",
    "\"AT\"",
    "println",
    "uint8",
    "t",
    "waitResponse",
    "uint32",
    "r1",
    "r2",
    "NULL",
    "r3",
    "data",
    "data.reserve",
    "64",
    "index",
    "for",
    "available",
    "read",
    "continue",
    "data.indexOf",
    "goto",
    "finish",
    "finish:",
    "waitOK",
    "ERROR",
    "\"OK\\r\\n\"",
    "\"ERROR\\r\\n\"",
    "\"E0\"",
    "SAPBR",
    "\\\"Contype\\\"",
    "\\\"GPRS\\\"\"",
    "\\\"APN\\\"",
    "\\\"\"",
    "\"\\\"\"",
    "#ifdef",
    "\\\"USER\\\"",
    "\\\"PWD\\\"",
    "CGDCONT",
    "\\\"IP\\\"",
    "CGACT",
    "1\"",
    "85000L",
    "0\"",
    "disconnected\"",
    "url",
    "Request:",
    "HTTPTERM\"",
    "HTTPINIT\"",
    "HTTPPARA",
    "\\\"CID\\\"",
    "USE",
    "HTTPS",
    "HTTPSSL",
    "\\\"URL\\\"",
    "\\\"https:",
    "#else",
    "\\\"CONTENT\\\"",
    "\\\"application",
    "json\\\"\"",
    "HTTPDATA",
    "10000",
    "\"DOWNLOAD\\r\\n\"",
    "HTTPACTION",
    "\"POST\"",
    "\"HEAD\"",
    "2\"",
    "\"DELETE\"",
    "3\"",
    "HTTPACTION:\"",
    "\"HTTPACTION",
    "Timeout\"",
    "readStringUntil",
    "'",
    "code",
    "size",
    "len",
    "200",
    "\"Error",
    "code:\"",
    "HTTPREAD\"",
    "10000L",
    "HTTPREAD:",
    "\"HTTPREAD",
    "Sparkfun",
    "Blynk",
    "Board",
    "Teensy3",
    "Template",
    "CUSTOM",
    "BOARD",
    "APP",
    "DEBUG",
    "\"BlynkProvisioning.h\"",
    "BlynkProvisioning.begin",
    "BlynkProvisioning.run",
    "SPARKFUN",
    "TheAirBoard",
    "11",
    "TheAirBoard.h",
    "TinyDuino",
    "BlynkSimpleTinyDuino.h",
    "WildFire",
    "V3",
    "WildFire.h",
    "BlynkSimpleWildFire.h",
    "wildfire",
    "wildfire.begin",
    "V4",
    "EspSwitch",
    "23",
    "LOW",
    "50",
    "WizFi310",
    "WizFi310.h",
    "BlynkSimpleWizFi310.h",
    "chipKIT",
    "Uno32",
    "myPlant",
    "example",
    "init",
    "run",
    "static",
    "sensorSoilMoisture",
    "60",
    "sensorAirHumidity",
    "wateringAmount",
    "wateringTimer",
    "isNotificationSent",
    "\"Watering",
    "amount:",
    "V6",
    "timer.enable",
    "started",
    "by",
    "user\"",
    "timer.disable",
    "stopped",
    "Blynk.syncVirtual",
    "float",
    "sinusoidal",
    "minv",
    "maxv",
    "period",
    "amp",
    "2.0",
    "med",
    "sin",
    "M",
    "PI",
    "randomize",
    "random",
    "3000L",
    "[]",
    "33",
    "\"DRY\"",
    "\"MOIST\"",
    "\"WET\"",
    "dayPeriod",
    "3.0",
    "light",
    "95",
    "\"LOW\"",
    "\"GOOD\"",
    "\"MED\"",
    "18",
    "1.0",
    "5000L",
    "constrain",
    "30",
    "90",
    "85",
    "20",
    "Blynk.email",
    "\"myPlant",
    "notification\"",
    "\"Your",
    "plant",
    "is",
    "thirsty",
    "\"Email",
    "notification",
    "sent\"",
    "automatically\""
  ],
  "total_tokens": 578
}