{
  "vocabulary": [
    "01helloworld",
    "/*************************************************************",
    "gpio2led",
    "gpio2",
    "blynk_for_chinese",
    "https",
    "//github",
    "com/hznupeter/blynk-library-for-chinese",
    "blynk",
    "//gitee",
    "com/hznupeter/blynk_iot/wikis",
    "*************************************************************/",
    "void",
    "setup()",
    "{",
    "pinmode(2,",
    "output);",
    "}",
    "loop()",
    "digitalwrite(2,",
    "high);",
    "",
    "02blynkblink",
    "io",
    "app",
    "button",
    "gpio2,",
    "switch",
    "define",
    "blynk_print",
    "serial",
    "//",
    "include",
    "<esp8266wifi",
    "h>",
    "<blynksimpleesp8266",
    "char",
    "auth",
    "=",
    "c3102448027d494ca48b27d0a732f245",
    ";//",
    "ssid",
    ";//wifi",
    "pass",
    "psssword",
    "begin(9600);",
    "begin(auth,",
    "ssid,",
    "pass);//",
    "03getdata",
    "slider",
    "v1",
    "2a365b624c0f4ea891256d4a66d428f7",
    "blynk_write(v1)",
    "int",
    "pinvalue",
    "param",
    "asint();",
    "04pushdata",
    "value",
    "display",
    "v5",
    "blynktimer",
    "timer;",
    "mytimerevent()",
    "10",
    "virtualwrite(v5,",
    "millis()",
    "attiny85",
    "download",
    "latest",
    "library",
    "here",
    "com/blynkkk/blynk-library/releases/latest",
    "is",
    "a",
    "platform",
    "with",
    "ios",
    "and",
    "android",
    "apps",
    "to",
    "control",
    "arduino,",
    "raspberry",
    "pi",
    "the",
    "likes",
    "over",
    "internet",
    "you",
    "can",
    "easily",
    "build",
    "graphic",
    "interfaces",
    "for",
    "all",
    "your",
    "projects",
    "by",
    "simply",
    "dragging",
    "dropping",
    "widgets",
    "downloads,",
    "docs,",
    "tutorials",
    "http",
    "//www",
    "adafruit_feather_m0_wifi",
    "arduino_ethernet",
    "cc",
    "sketch",
    "generator",
    "//examples",
    "arduino_gsm",
    "arduino_mkr1000",
    "arduino_mkr1010",
    "arduino_serial_usb",
    "arduino_softwareserial",
    "arduino_wifi_shield",
    "arduino_wifi_shield_101",
    "arduino_yun",
    "arduino_zero_m0_serial",
    "arduino_org_uno_wifi",
    "blue_pill_stm32f103c",
    "cc3000",
    "digistump_digispark",
    "digistump_oak",
    "esp32_wifi",
    "esp32_wifi_ssl",
    "esp8266",
    "esp8266_shield",
    "esp8266_standalone",
    "esp8266_standalone_manual_ip",
    "esp8266_standalone_ssl",
    "esp8266_standalone_smartconfig",
    "energia_serial_usb",
    "energia_wifi",
    "fishino",
    "intel_edison_wifi",
    "linkitone",
    "nodemcu",
    "rn_xv_wifly",
    "redbear_duo_wifi",
    "sim800_sim900",
    "sparkfun_blynk_board",
    "teensy3",
    "template_esp32",
    "this",
    "demo",
    "use",
    "it",
    "only",
    "development",
    "testing",
    "should",
    "open",
    "setting",
    "h",
    "modify",
    "general",
    "options",
    "if",
    "would",
    "like",
    "add",
    "these",
    "features",
    "product,",
    "please",
    "contact",
    "businesses",
    "io/",
    "use_wrover_board",
    "use_custom_board",
    "template_esp8266",
    "use_sparkfun_blynk_board",
    "uncomment",
    "board",
    "template_mkr1000",
    "example",
    "requires",
    "some",
    "additional",
    "libraries",
    "theairboard_wifly",
    "tinyduino_wifi",
    "wildfire_v3",
    "wildfire_v4",
    "wizfi310",
    "chipkit_uno32",
    "myplant_esp8266",
    "which",
    "works",
    "myplant",
    "showcases",
    "how",
    "made",
    "work",
    "free",
    "//itunes",
    "apple",
    "com/us/app/blynk-myplant/id1163620518",
    "mt=8",
    "//play",
    "google",
    "com/store/apps/details",
    "id=cc",
    "appexport"
  ],
  "total_tokens": 212
}