{
  "vocabulary": [
    "01HelloWorld",
    "/*************************************************************",
    "项目说明：点亮GPIO2LED",
    "硬件连接：",
    "闪灯模块连接在GPIO2管脚",
    "blynk_for_chinese",
    "库地址：https://github.com/hznupeter/blynk-library-for-chinese",
    "Blynk物联网学习资料：https://gitee.com/hznupeter/Blynk_IOT/wikis",
    "*************************************************************/",
    "void",
    "setup()",
    "{",
    "pinMode(2,",
    "OUTPUT);",
    "}",
    "loop()",
    "digitalWrite(2,",
    "HIGH);",
    "",
    "02BlynkBlink",
    "项目说明：控制IO电平",
    "App项目设置:",
    "创建Button组件，输出管脚设置为GPIO2,模式设为Switch",
    "#define",
    "BLYNK_PRINT",
    "Serial",
    "//",
    "开启串口监视",
    "#include",
    "<ESP8266WiFi.h>",
    "<BlynkSimpleEsp8266.h>",
    "char",
    "auth[]",
    "=",
    "\"c3102448027d494ca48b27d0a732f245\";//授权码",
    "ssid[]",
    "\"ssid\";//wifi名称",
    "pass[]",
    "\"psssword\";//wifi密码",
    "Serial.begin(9600);",
    "Blynk.begin(auth,",
    "ssid,",
    "pass);//官方服务器",
    "//Blynk.begin(auth,",
    "pass,",
    "\"blynk-cloud.com\",",
    "8080);//自建服务器域名模式",
    "IPAddress(192,",
    "168,",
    "1,",
    "158),",
    "03GetData",
    "项目说明：从app获取数据",
    "创建Slider组件，输出管脚设置为V1",
    "\"2a365b624c0f4ea891256d4a66d428f7\";//授权码",
    "BLYNK_WRITE(V1)",
    "int",
    "pinValue",
    "param.asInt();",
    "从虚拟管脚V1获取整数",
    "或者用以下方式",
    "String",
    "i",
    "param.asStr();",
    "double",
    "d",
    "param.asDouble();",
    "Serial.print(\"V1",
    "04PushData",
    "项目说明：主动发送数据给app",
    "创建value",
    "display组件，输入管脚设置为V5",
    "BlynkTimer",
    "timer;",
    "myTimerEvent()",
    "发送数据的频率不要超过每秒10次。",
    "Blynk.virtualWrite(V5,",
    "millis()",
    "/",
    "1000);",
    "ATtiny85",
    "Download",
    "latest",
    "Blynk",
    "library",
    "here:",
    "https://github.com/blynkkk/blynk-library/releases/latest",
    "is",
    "a",
    "platform",
    "with",
    "iOS",
    "and",
    "Android",
    "apps",
    "to",
    "control",
    "Arduino,",
    "Raspberry",
    "Pi",
    "the",
    "likes",
    "over",
    "Internet.",
    "You",
    "can",
    "easily",
    "build",
    "graphic",
    "interfaces",
    "for",
    "all",
    "your",
    "projects",
    "by",
    "simply",
    "dragging",
    "dropping",
    "widgets.",
    "Downloads,",
    "docs,",
    "tutorials:",
    "http://www.blynk.cc",
    "Sketch",
    "generator:",
    "http://examples.blynk.cc",
    "Adafruit_Feather_M0_WiFi",
    "Arduino_Ethernet",
    "community:",
    "http://community.blynk.cc",
    "Follow",
    "us:",
    "http://www.fb.com/blynkapp",
    "Arduino_GSM",
    "Arduino_MKR1000",
    "Arduino_MKR1010",
    "Arduino_Serial_USB",
    "Arduino_SoftwareSerial",
    "Arduino_WiFi_Shield",
    "Arduino_WiFi_Shield_101",
    "Arduino_Yun",
    "Arduino_Zero_M0_Serial",
    "Arduino_org_UNO_WiFi",
    "Blue_Pill_STM32F103C",
    "CC3000",
    "Digistump_Digispark",
    "Digistump_Oak",
    "ESP32_WiFi",
    "ESP32_WiFi_SSL",
    "ESP8266",
    "ESP8266_Shield",
    "ESP8266_Standalone",
    "ESP8266_Standalone_Manual_IP",
    "ESP8266_Standalone_SSL",
    "ESP8266_Standalone_SmartConfig",
    "Energia_Serial_USB",
    "Energia_WiFi",
    "Fishino",
    "Intel_Edison_WiFi",
    "LinkItONE",
    "NodeMCU",
    "RN_XV_WiFly",
    "RedBear_Duo_WiFi",
    "SIM800_SIM900",
    "Sparkfun_Blynk_Board",
    "Teensy3",
    "Template_ESP32",
    "This",
    "DEMO.",
    "use",
    "it",
    "only",
    "development",
    "testing.",
    "should",
    "open",
    "Setting.h",
    "modify",
    "General",
    "options.",
    "If",
    "you",
    "would",
    "like",
    "add",
    "these",
    "features",
    "product,",
    "please",
    "contact",
    "Businesses:",
    "http://www.blynk.io/",
    "//#define",
    "USE_WROVER_BOARD",
    "USE_CUSTOM_BOARD",
    "See",
    "\"Custom",
    "board",
    "configuration\"",
    "in",
    "Template_ESP8266",
    "USE_SPARKFUN_BLYNK_BOARD",
    "Uncomment",
    "are",
    "using",
    "Template_MKR1000",
    "example",
    "requires",
    "some",
    "additional",
    "libraries:",
    "https://github.com/cmaglie/FlashStorage",
    "https://github.com/michael71/Timer5",
    "USE_MKR1000_BOARD",
    "TheAirBoard_WiFly",
    "TinyDuino_WiFi",
    "WildFire_V3",
    "WildFire_V4",
    "WizFi310",
    "chipKIT_Uno32",
    "myPlant_ESP8266",
    "DEMO",
    "sketch",
    "which",
    "works",
    "myPlant",
    "app",
    "showcases",
    "how",
    "made",
    "work",
    "download",
    "free",
    "iOS:",
    "https://itunes.apple.com/us/app/blynk-myplant/id1163620518?mt=8",
    "Android:",
    "https://play.google.com/store/apps/details?id=cc.blynk.appexport.demo"
  ],
  "total_tokens": 237
}