{
  "vocabulary": [
    "<PAD>",
    "<START>",
    "<END>",
    "01helloworld",
    "/*************************************************************",
    "gpio2led",
    "gpio2",
    "blynk_for_chinese",
    "https",
    "//github.com/hznupeter/blynk-library-for-chinese",
    "blynk",
    "//gitee.com/hznupeter/blynk_iot/wikis",
    "*************************************************************/",
    "void",
    "setup()",
    "{",
    "pinmode(2",
    "output);",
    "}",
    "loop()",
    "digitalwrite(2",
    "high);",
    "02blynkblink",
    "io",
    "app",
    "button",
    "switch",
    "#define",
    "blynk_print",
    "serial",
    "//",
    "#include",
    "<esp8266wifi.h>",
    "<blynksimpleesp8266.h>",
    "char",
    "auth[]",
    "=",
    "c3102448027d494ca48b27d0a732f245",
    ";//",
    "ssid[]",
    "ssid",
    ";//wifi",
    "pass[]",
    "psssword",
    "serial.begin(9600);",
    "blynk.begin(auth",
    "pass);//",
    "//blynk.begin(auth",
    "pass",
    "blynk-cloud.com",
    "8080);//",
    "ipaddress(192",
    "168",
    "1",
    "158)",
    "ip",
    "blynk.run();",
    "03getdata",
    "slider",
    "v1",
    "2a365b624c0f4ea891256d4a66d428f7",
    "blynk_write(v1)",
    "int",
    "pinvalue",
    "param.asint();",
    "string",
    "i",
    "param.asstr();",
    "double",
    "d",
    "param.asdouble();",
    "serial.print(",
    "value",
    "is",
    ");",
    "serial.println(pinvalue);",
    "04pushdata",
    "display",
    "v5",
    "blynktimer",
    "timer;",
    "mytimerevent()",
    "10",
    "blynk.virtualwrite(v5",
    "millis()",
    "/",
    "1000);",
    "timer.setinterval(1000l",
    "mytimerevent);//",
    "1000",
    "mytimerevent",
    "timer.run();",
    "attiny85",
    "download",
    "latest",
    "library",
    "here",
    "//github.com/blynkkk/blynk-library/releases/latest",
    "a",
    "platform",
    "with",
    "ios",
    "and",
    "android",
    "apps",
    "to",
    "control",
    "arduino",
    "raspberry",
    "pi",
    "the",
    "likes",
    "over",
    "internet.",
    "you",
    "can",
    "easily",
    "build",
    "graphic",
    "interfaces",
    "for",
    "all",
    "your",
    "projects",
    "by",
    "simply",
    "dragging",
    "dropping",
    "widgets.",
    "downloads",
    "docs",
    "tutorials",
    "http",
    "//www.blynk.cc",
    "sketch",
    "generator",
    "//examples.blynk.cc",
    "community",
    "//community.blynk.cc",
    "follow",
    "us",
    "//www.fb.com/blynkapp",
    "//twitter.com/blynk_app",
    "licensed",
    "under",
    "mit",
    "license",
    "this",
    "example",
    "code",
    "in",
    "public",
    "domain.",
    "*************************************************************",
    "=>",
    "usb",
    "howto",
    "//tiny.cc/blynkusb",
    "note",
    "requires",
    "attiny",
    "support",
    "package",
    "//github.com/damellis/attiny",
    "be",
    "sure",
    "check",
    "ordinary",
    "first!!!",
    "+-",
    "/-+",
    "a0|6",
    "(d",
    "5)",
    "pb5",
    "1|",
    "|8",
    "vcc",
    "a3|9",
    "3)",
    "pb3",
    "2|",
    "|7",
    "pb2",
    "2)",
    "a1|7",
    "a2|8",
    "4)",
    "pb4",
    "3|",
    "|6",
    "pb1",
    "1)",
    "pwm1",
    "gnd",
    "4|",
    "|5",
    "pb0",
    "0)",
    "pwm0",
    "+----+",
    "<softwareserial.h>",
    "softwareserial",
    "debugserial(1",
    "2);",
    "rx",
    "tx",
    "swserial(3",
    "4);",
    "/*",
    "comment",
    "out",
    "disable",
    "prints",
    "save",
    "space",
    "*/",
    "debugserial",
    "<blynksimplestream.h>",
    "should",
    "get",
    "auth",
    "token",
    "app.",
    "go",
    "project",
    "settings",
    "(nut",
    "icon).",
    "yourauthtoken",
    ";",
    "//#include",
    "<softwareservo.h>",
    "//softwareservo",
    "servo1;",
    "debug",
    "console",
    "debugserial.begin(9600);",
    "adafruit_feather_m0_wifi",
    "shows",
    "how",
    "use",
    "adafruit",
    "feather",
    "m0",
    "wifi",
    "connect",
    "blynk.",
    "wifi101",
    "from",
    "//librarymanager/all#wifi101",
    "feel",
    "free",
    "apply",
    "it",
    "any",
    "other",
    "example.",
    "s",
    "simple!",
    "<wifi101.h>",
    "<blynksimplewifishield101.h>",
    "credentials.",
    "set",
    "password",
    "open",
    "networks.",
    "yournetworkname",
    "yourpassword",
    "wifi.setpins(8",
    "7",
    "4",
    "pass);",
    "also",
    "specify",
    "server",
    "arduino_ethernet",
    "setup",
    "widget",
    "on",
    "v2",
    "pins",
    "11",
    "12",
    "13",
    "are",
    "reserved",
    "ethernet",
    "module.",
    "don",
    "t",
    "them",
    "directly!",
    "warning",
    "if",
    "have",
    "an",
    "sd",
    "card",
    "may",
    "need",
    "setting",
    "pin",
    "high.",
    "read",
    "more",
    "//www.arduino.cc/en/main/arduinoethernetshield",
    "<spi.h>",
    "<ethernet.h>",
    "const",
    "cloud",
    "char*",
    "host",
    "unsigned",
    "port",
    "8080;",
    "network",
    "byte",
    "mac[]",
    "0xde",
    "0xad",
    "0xbe",
    "0xef",
    "0xfe",
    "0xed",
    "};",
    "ethernetclient",
    "client;",
    "w5100_cs",
    "sdcard_cs",
    "start",
    "connection",
    "connectnetwork()",
    "serial.println(",
    "connecting",
    "ethernet...",
    "pinmode(sdcard_cs",
    "arduino_gsm",
    "<gsm.h>",
    "pinnumber",
    "apn",
    "data",
    "gprs_apn",
    "replace",
    "gprs",
    "gprs_login",
    "login",
    "gprs_password",
    "gsmclient",
    "gprs;",
    "gsm",
    "gsmaccess;",
    "gsm...",
    "bool",
    "status",
    "false;",
    "after",
    "starting",
    "modem",
    "gsm.begin()",
    "attach",
    "shield",
    "while",
    "(status",
    "==",
    "false)",
    "arduino_mkr1000",
    "mkr1000",
    "<blynksimplemkr1000.h>",
    "80);",
    "arduino_mkr1010",
    "mkr",
    "1010",
    "wifinina",
    "//librarymanager/all#wifinina",
    "<wifinina.h>",
    "<blynksimplewifinina.h>",
    "arduino_serial_usb",
    "could",
    "spare",
    "hardware",
    "boards",
    "that",
    "(like",
    "mega)",
    "debugserial(2",
    "3);",
    "will",
    "work",
    "through",
    "do",
    "not",
    "or",
    "write",
    "manually",
    "blynk.begin(serial",
    "auth);",
    "arduino_softwareserial",
    "swserial(2",
    "swserial.begin(9600);",
    "blynk.begin(swserial",
    "arduino_wifi_shield",
    "please",
    "update",
    "firmware",
    "//www.arduino.cc/en/hacking/wifishieldfirmwareupgrading",
    "<wifi.h>",
    "<blynksimplewifi.h>",
    "arduino_wifi_shield_101",
    "101",
    "arduino_yun",
    "yun",
    "bridge",
    "<bridge.h>",
    "<blynksimpleyun.h>",
    "blynk.begin(auth);",
    "100)",
    "8080);",
    "arduino_zero_m0_serial",
    "social",
    "networks",
    "serialusb",
    "serialusb.begin(9600);",
    "arduino_org_uno_wifi",
    "arduino.org",
    "uno",
    "link",
    "//librarymanager/all#wifi_link",
    "wifilink",
    "1.0.0",
    "(at",
    "least).",
    "<wifilink.h>",
    "<blynksimplewifilink.h>",
    "blue_pill_stm32f103c",
    "stm32duino",
    "//github.com/rogerclarkmelbourne/arduino_stm32/wiki/installation",
    "wait",
    "up",
    "30",
    "seconds",
    "board",
    "starts",
    "allow",
    "initialize",
    "completely.",
    "serial1",
    "serial1.begin(9600);",
    "cc3000",
    "breakout",
    "adafruit_cc3000_library",
    "//github.com/adafruit/adafruit_cc3000_library",
    "version",
    "1.14",
    "later",
    "preferred.",
    "1.",
    "definitions",
    "according",
    "setup.",
    "2.",
    "change",
    "3.",
    "run",
    ")",
    "these",
    "interrupt",
    "3000",
    "adafruit_cc3000_irq",
    "3",
    "adafruit_cc3000_vbat",
    "5",
    "adafruit_cc3000_cs",
    "<adafruit_cc3000.h>",
    "<blynksimplecc3000.h>",
    "digistump_digispark",
    "there",
    "issue",
    "linux",
    "//github.com/digistump/digistumparduino/issues/16",
    "minimize",
    "size",
    "non-pro",
    "#if",
    "!defined(arduino_avr_digisparkpro)",
    "blynk_no_info",
    "blynk_no_builtin",
    "#endif",
    "<digicdc.h>",
    "serialusb.begin();",
    "blynk.begin(serialusb",
    "digistump_oak",
    "digistump",
    "oak",
    "select",
    "right",
    "type",
    "tools",
    "->",
    "menu!",
    "has",
    "already",
    "configured",
    "blynk.config(auth);",
    "esp32_wifi",
    "runs",
    "directly",
    "esp32",
    "chip.",
    "//github.com/espressif/arduino-esp32",
    "module",
    "<wificlient.h>",
    "<blynksimpleesp32.h>",
    "esp32_wifi_ssl",
    "<wificlientsecure.h>",
    "<blynksimpleesp32_ssl.h>",
    "esp8266",
    "yourwifi",
    "wificlient",
    "serial.println(ssid);",
    "wifi.begin(ssid",
    "(wifi.status()",
    "!=",
    "wl_connected)",
    "delay(500);",
    ".",
    "serial.println();",
    "connected",
    "httprequest(const",
    "string&",
    "method",
    "request",
    "response)",
    "serial.print(f(",
    "));",
    "serial.print(host);",
    "serial.print(port);",
    "...",
    "(client.connect(host",
    "port))",
    "ok",
    "else",
    "failed",
    "return",
    "esp8266_shield",
    "(with",
    "at",
    "commands)",
    "warning!",
    "very",
    "tricky",
    "working.",
    "article",
    "//help.blynk.cc/hardware-and-libraries/arduino/esp8266-with-at-firmware",
    "<esp8266_lib.h>",
    "<blynksimpleshieldesp8266.h>",
    "esp8266_standalone",
    "//github.com/esp8266/arduino",
    "esp8266_standalone_manual_ip",
    "mac",
    "address",
    "different",
    "each",
    "device",
    "lan",
    "arduino_mac[]",
    "0xba",
    "ipaddress",
    "device_ip",
    "(192",
    "0",
    "esp8266_standalone_ssl",
    "<blynksimpleesp8266_ssl.h>",
    "esp8266_standalone_smartconfig",
    "smartconfig",
    "might",
    "environment.",
    "try",
    "basic",
    "examples",
    "before",
    "using",
    "sketch!",
    "wifi.mode(wifi_sta);",
    "cnt",
    "0;",
    "(cnt++",
    ">=",
    "10)",
    "energia_serial_usb",
    "energia",
    "ide",
    "//energia.nu/download/",
    "energia_wifi",
    "tested",
    "ti",
    "msp430f5529",
    "+",
    "cc3100",
    "cc3200-launchxl",
    "redbearlab",
    "cc3200",
    "mini",
    "w/",
    "micro",
    "<blynksimpleenergiawifi.h>",
    "fishino",
    "software",
    "libraries",
    "//fishino.it/en/download/",
    "<fishino.h>",
    "<blynksimplefishino.h>",
    "intel_edison_wifi",
    "intel",
    "edison",
    "(wifi).",
    "<blynksimpleinteledisonwifi.h>",
    "one",
    "of",
    "those",
    "commands",
    "server_ip",
    "port);",
    "linkitone",
    "<lwifi.h>",
    "<lwificlient.h>",
    "<blynksimplelinkitone.h>",
    "choose",
    "wifi_sec",
    "lwifi_open",
    "lwifi_wpa",
    "lwifi_wep",
    "lwifi_wpa;",
    "wifi_sec);",
    "nodemcu",
    "nodemcu.",
    "advanced",
    "esp",
    "-",
    "esp8266_standalone_manual_ip.ino",
    "esp8266_standalone_smartconfig.ino",
    "esp8266_standalone_ssl.ino",
    "rn_xv_wifly",
    "wifly",
    "rn-xv",
    "wiflyhq",
    "//github.com/harlequin-tech/wiflyhq",
    "ensure",
    "stable",
    "connection!",
    "4.41",
    "<wiflyhq.h>",
    "<blynksimplewifly.h>",
    "redbear_duo_wifi",
    "redbear",
    "duo",
    "<blynksimpleredbear_duo.h>",
    "wpa2",
    "wpa",
    "wep",
    "wpa2;",
    "//system_mode(automatic);",
    "system_mode(manual);",
    "delay(5000);",
    "wifi.on();",
    "wifi.setcredentials(ssid",
    "wifi.connect();",
    "sim800_sim900",
    "attention!",
    "phone",
    "sim",
    "ballance",
    "user",
    "correct",
    "internet",
    "correctly",
    "inserted",
    "into",
    "provide",
    "good",
    "power",
    "supply",
    "(up",
    "2a)",
    "(4.0-4.2v",
    "5v",
    "documentation)",
    "4.",
    "(hardware",
    "recommended)",
    "5.",
    "antenna",
    "attached",
    "yourapn",
    "gprs_user",
    "uncomment",
    "sparkfun_blynk_board",
    "sparkfun",
    "board.",
    "1.0",
    "(compatible",
    "board)",
    "menu",
    "teensy3",
    "template_esp32",
    "demo.",
    "only",
    "development",
    "testing.",
    "setting.h",
    "modify",
    "general",
    "options.",
    "would",
    "like",
    "add",
    "features",
    "product",
    "contact",
    "businesses",
    "//www.blynk.io/",
    "//#define",
    "use_wrover_board",
    "use_custom_board",
    "see",
    "custom",
    "configuration",
    "settings.h",
    "app_debug",
    "blynkprovisioning.h",
    "serial.begin(115200);",
    "blynkprovisioning.begin();",
    "handles",
    "blynkprovisioning.run();",
    "template_esp8266",
    "use_sparkfun_blynk_board",
    "use_node_mcu_board",
    "use_witty_cloud_board",
    "esp8266-based",
    "template_mkr1000",
    "some",
    "additional",
    "//github.com/cmaglie/flashstorage",
    "//github.com/michael71/timer5",
    "use_mkr1000_board",
    "theairboard_wifly",
    "airboard",
    "//www.theairboard.cc/quick-start/",
    "debugserial(10",
    "11);",
    "<theairboard.h>",
    "tinyduino_wifi",
    "tinycircuits",
    "tools->board",
    "pro",
    "tools->processor",
    "atmega",
    "328",
    "(3.3v",
    "8mhz)",
    "<blynksimpletinyduino.h>",
    "wlan_sec_unsec",
    "wlan_sec_wep",
    "wlan_sec_wpa",
    "wlan_sec_wpa2",
    "wildfire_v3",
    "wildfire",
    "install",
    "//shop.wickeddevice.com/resources/wildfire/",
    "<wildfire.h>",
    "<wildfire_cc3000.h>",
    "<blynksimplewildfire.h>",
    "wildfire;",
    "wildfire_v4",
    "v4",
    "digital",
    "used",
    "reset/enable",
    "wizfi310",
    "//librarymanager/all#wizfi310",
    "<wizfi310.h>",
    "<blynksimplewizfi310.h>",
    "chipkit_uno32",
    "39",
    "(rx)",
    "40",
    "(tx)",
    "myplant_esp8266",
    "demo",
    "which",
    "works",
    "myplant",
    "showcases",
    "made",
    "//itunes.apple.com/us/app/blynk-myplant/id1163620518",
    "mt=8",
    "//play.google.com/store/apps/details",
    "id=cc.blynk.appexport.demo",
    "/**************************************************************",
    "*",
    "workflow",
    "network.",
    "first",
    "acts",
    "as",
    "access",
    "point",
    "broadcasts",
    "own",
    "wifi.",
    "smartphone",
    "connects",
    "new",
    "passes",
    "together",
    "saves",
    "information",
    "eeprom",
    "reboots",
    "now"
  ],
  "total_tokens": 820,
  "tokenToIndex": {
    "0": 570,
    "1": 53,
    "3": 469,
    "4": 271,
    "5": 471,
    "7": 270,
    "10": 82,
    "11": 282,
    "12": 283,
    "13": 284,
    "30": 439,
    "39": 783,
    "40": 785,
    "101": 409,
    "168": 52,
    "328": 757,
    "1000": 89,
    "1010": 372,
    "3000": 467,
    "<PAD>": 0,
    "<START>": 1,
    "<END>": 2,
    "01helloworld": 3,
    "/*************************************************************": 4,
    "gpio2led": 5,
    "gpio2": 6,
    "blynk_for_chinese": 7,
    "https": 8,
    "//github.com/hznupeter/blynk-library-for-chinese": 9,
    "blynk": 10,
    "//gitee.com/hznupeter/blynk_iot/wikis": 11,
    "*************************************************************/": 12,
    "void": 13,
    "setup()": 14,
    "{": 15,
    "pinmode(2": 16,
    "output);": 17,
    "}": 18,
    "loop()": 19,
    "digitalwrite(2": 20,
    "high);": 21,
    "02blynkblink": 22,
    "io": 23,
    "app": 24,
    "button": 25,
    "switch": 26,
    "#define": 27,
    "blynk_print": 28,
    "serial": 29,
    "//": 30,
    "#include": 31,
    "<esp8266wifi.h>": 32,
    "<blynksimpleesp8266.h>": 33,
    "char": 34,
    "auth[]": 35,
    "=": 36,
    "c3102448027d494ca48b27d0a732f245": 37,
    ";//": 38,
    "ssid[]": 39,
    "ssid": 40,
    ";//wifi": 41,
    "pass[]": 42,
    "psssword": 43,
    "serial.begin(9600);": 44,
    "blynk.begin(auth": 45,
    "pass);//": 46,
    "//blynk.begin(auth": 47,
    "pass": 48,
    "blynk-cloud.com": 49,
    "8080);//": 50,
    "ipaddress(192": 51,
    "158)": 54,
    "ip": 55,
    "blynk.run();": 56,
    "03getdata": 57,
    "slider": 58,
    "v1": 59,
    "2a365b624c0f4ea891256d4a66d428f7": 60,
    "blynk_write(v1)": 61,
    "int": 62,
    "pinvalue": 63,
    "param.asint();": 64,
    "string": 65,
    "i": 66,
    "param.asstr();": 67,
    "double": 68,
    "d": 69,
    "param.asdouble();": 70,
    "serial.print(": 71,
    "value": 72,
    "is": 73,
    ");": 74,
    "serial.println(pinvalue);": 75,
    "04pushdata": 76,
    "display": 77,
    "v5": 78,
    "blynktimer": 79,
    "timer;": 80,
    "mytimerevent()": 81,
    "blynk.virtualwrite(v5": 83,
    "millis()": 84,
    "/": 85,
    "1000);": 86,
    "timer.setinterval(1000l": 87,
    "mytimerevent);//": 88,
    "mytimerevent": 90,
    "timer.run();": 91,
    "attiny85": 92,
    "download": 93,
    "latest": 94,
    "library": 95,
    "here": 96,
    "//github.com/blynkkk/blynk-library/releases/latest": 97,
    "a": 98,
    "platform": 99,
    "with": 100,
    "ios": 101,
    "and": 102,
    "android": 103,
    "apps": 104,
    "to": 105,
    "control": 106,
    "arduino": 107,
    "raspberry": 108,
    "pi": 109,
    "the": 110,
    "likes": 111,
    "over": 112,
    "internet.": 113,
    "you": 114,
    "can": 115,
    "easily": 116,
    "build": 117,
    "graphic": 118,
    "interfaces": 119,
    "for": 120,
    "all": 121,
    "your": 122,
    "projects": 123,
    "by": 124,
    "simply": 125,
    "dragging": 126,
    "dropping": 127,
    "widgets.": 128,
    "downloads": 129,
    "docs": 130,
    "tutorials": 131,
    "http": 132,
    "//www.blynk.cc": 133,
    "sketch": 134,
    "generator": 135,
    "//examples.blynk.cc": 136,
    "community": 137,
    "//community.blynk.cc": 138,
    "follow": 139,
    "us": 140,
    "//www.fb.com/blynkapp": 141,
    "//twitter.com/blynk_app": 142,
    "licensed": 143,
    "under": 144,
    "mit": 145,
    "license": 146,
    "this": 147,
    "example": 148,
    "code": 149,
    "in": 150,
    "public": 151,
    "domain.": 152,
    "*************************************************************": 153,
    "=>": 154,
    "usb": 155,
    "howto": 156,
    "//tiny.cc/blynkusb": 157,
    "note": 158,
    "requires": 159,
    "attiny": 160,
    "support": 161,
    "package": 162,
    "//github.com/damellis/attiny": 163,
    "be": 164,
    "sure": 165,
    "check": 166,
    "ordinary": 167,
    "first!!!": 168,
    "+-": 169,
    "/-+": 170,
    "a0|6": 171,
    "(d": 172,
    "5)": 173,
    "pb5": 174,
    "1|": 175,
    "|8": 176,
    "vcc": 177,
    "a3|9": 178,
    "3)": 179,
    "pb3": 180,
    "2|": 181,
    "|7": 182,
    "pb2": 183,
    "2)": 184,
    "a1|7": 185,
    "a2|8": 186,
    "4)": 187,
    "pb4": 188,
    "3|": 189,
    "|6": 190,
    "pb1": 191,
    "1)": 192,
    "pwm1": 193,
    "gnd": 194,
    "4|": 195,
    "|5": 196,
    "pb0": 197,
    "0)": 198,
    "pwm0": 199,
    "+----+": 200,
    "<softwareserial.h>": 201,
    "softwareserial": 202,
    "debugserial(1": 203,
    "2);": 204,
    "rx": 205,
    "tx": 206,
    "swserial(3": 207,
    "4);": 208,
    "/*": 209,
    "comment": 210,
    "out": 211,
    "disable": 212,
    "prints": 213,
    "save": 214,
    "space": 215,
    "*/": 216,
    "debugserial": 217,
    "<blynksimplestream.h>": 218,
    "should": 219,
    "get": 220,
    "auth": 221,
    "token": 222,
    "app.": 223,
    "go": 224,
    "project": 225,
    "settings": 226,
    "(nut": 227,
    "icon).": 228,
    "yourauthtoken": 229,
    ";": 230,
    "//#include": 231,
    "<softwareservo.h>": 232,
    "//softwareservo": 233,
    "servo1;": 234,
    "debug": 235,
    "console": 236,
    "debugserial.begin(9600);": 237,
    "adafruit_feather_m0_wifi": 238,
    "shows": 239,
    "how": 240,
    "use": 241,
    "adafruit": 242,
    "feather": 243,
    "m0": 244,
    "wifi": 245,
    "connect": 246,
    "blynk.": 247,
    "wifi101": 248,
    "from": 249,
    "//librarymanager/all#wifi101": 250,
    "feel": 251,
    "free": 252,
    "apply": 253,
    "it": 254,
    "any": 255,
    "other": 256,
    "example.": 257,
    "s": 258,
    "simple!": 259,
    "<wifi101.h>": 260,
    "<blynksimplewifishield101.h>": 261,
    "credentials.": 262,
    "set": 263,
    "password": 264,
    "open": 265,
    "networks.": 266,
    "yournetworkname": 267,
    "yourpassword": 268,
    "wifi.setpins(8": 269,
    "pass);": 272,
    "also": 273,
    "specify": 274,
    "server": 275,
    "arduino_ethernet": 276,
    "setup": 277,
    "widget": 278,
    "on": 279,
    "v2": 280,
    "pins": 281,
    "are": 285,
    "reserved": 286,
    "ethernet": 287,
    "module.": 288,
    "don": 289,
    "t": 290,
    "them": 291,
    "directly!": 292,
    "warning": 293,
    "if": 294,
    "have": 295,
    "an": 296,
    "sd": 297,
    "card": 298,
    "may": 299,
    "need": 300,
    "setting": 301,
    "pin": 302,
    "high.": 303,
    "read": 304,
    "more": 305,
    "//www.arduino.cc/en/main/arduinoethernetshield": 306,
    "<spi.h>": 307,
    "<ethernet.h>": 308,
    "const": 309,
    "cloud": 310,
    "char*": 311,
    "host": 312,
    "unsigned": 313,
    "port": 314,
    "8080;": 315,
    "network": 316,
    "byte": 317,
    "mac[]": 318,
    "0xde": 319,
    "0xad": 320,
    "0xbe": 321,
    "0xef": 322,
    "0xfe": 323,
    "0xed": 324,
    "};": 325,
    "ethernetclient": 326,
    "client;": 327,
    "w5100_cs": 328,
    "sdcard_cs": 329,
    "start": 330,
    "connection": 331,
    "connectnetwork()": 332,
    "serial.println(": 333,
    "connecting": 334,
    "ethernet...": 335,
    "pinmode(sdcard_cs": 336,
    "arduino_gsm": 337,
    "<gsm.h>": 338,
    "pinnumber": 339,
    "apn": 340,
    "data": 341,
    "gprs_apn": 342,
    "replace": 343,
    "gprs": 344,
    "gprs_login": 345,
    "login": 346,
    "gprs_password": 347,
    "gsmclient": 348,
    "gprs;": 349,
    "gsm": 350,
    "gsmaccess;": 351,
    "gsm...": 352,
    "bool": 353,
    "status": 354,
    "false;": 355,
    "after": 356,
    "starting": 357,
    "modem": 358,
    "gsm.begin()": 359,
    "attach": 360,
    "shield": 361,
    "while": 362,
    "(status": 363,
    "==": 364,
    "false)": 365,
    "arduino_mkr1000": 366,
    "mkr1000": 367,
    "<blynksimplemkr1000.h>": 368,
    "80);": 369,
    "arduino_mkr1010": 370,
    "mkr": 371,
    "wifinina": 373,
    "//librarymanager/all#wifinina": 374,
    "<wifinina.h>": 375,
    "<blynksimplewifinina.h>": 376,
    "arduino_serial_usb": 377,
    "could": 378,
    "spare": 379,
    "hardware": 380,
    "boards": 381,
    "that": 382,
    "(like": 383,
    "mega)": 384,
    "debugserial(2": 385,
    "3);": 386,
    "will": 387,
    "work": 388,
    "through": 389,
    "do": 390,
    "not": 391,
    "or": 392,
    "write": 393,
    "manually": 394,
    "blynk.begin(serial": 395,
    "auth);": 396,
    "arduino_softwareserial": 397,
    "swserial(2": 398,
    "swserial.begin(9600);": 399,
    "blynk.begin(swserial": 400,
    "arduino_wifi_shield": 401,
    "please": 402,
    "update": 403,
    "firmware": 404,
    "//www.arduino.cc/en/hacking/wifishieldfirmwareupgrading": 405,
    "<wifi.h>": 406,
    "<blynksimplewifi.h>": 407,
    "arduino_wifi_shield_101": 408,
    "arduino_yun": 410,
    "yun": 411,
    "bridge": 412,
    "<bridge.h>": 413,
    "<blynksimpleyun.h>": 414,
    "blynk.begin(auth);": 415,
    "100)": 416,
    "8080);": 417,
    "arduino_zero_m0_serial": 418,
    "social": 419,
    "networks": 420,
    "serialusb": 421,
    "serialusb.begin(9600);": 422,
    "arduino_org_uno_wifi": 423,
    "arduino.org": 424,
    "uno": 425,
    "link": 426,
    "//librarymanager/all#wifi_link": 427,
    "wifilink": 428,
    "1.0.0": 429,
    "(at": 430,
    "least).": 431,
    "<wifilink.h>": 432,
    "<blynksimplewifilink.h>": 433,
    "blue_pill_stm32f103c": 434,
    "stm32duino": 435,
    "//github.com/rogerclarkmelbourne/arduino_stm32/wiki/installation": 436,
    "wait": 437,
    "up": 438,
    "seconds": 440,
    "board": 441,
    "starts": 442,
    "allow": 443,
    "initialize": 444,
    "completely.": 445,
    "serial1": 446,
    "serial1.begin(9600);": 447,
    "cc3000": 448,
    "breakout": 449,
    "adafruit_cc3000_library": 450,
    "//github.com/adafruit/adafruit_cc3000_library": 451,
    "version": 452,
    "1.14": 453,
    "later": 454,
    "preferred.": 455,
    "1.": 456,
    "definitions": 457,
    "according": 458,
    "setup.": 459,
    "2.": 460,
    "change": 461,
    "3.": 462,
    "run": 463,
    ")": 464,
    "these": 465,
    "interrupt": 466,
    "adafruit_cc3000_irq": 468,
    "adafruit_cc3000_vbat": 470,
    "adafruit_cc3000_cs": 472,
    "<adafruit_cc3000.h>": 473,
    "<blynksimplecc3000.h>": 474,
    "digistump_digispark": 475,
    "there": 476,
    "issue": 477,
    "linux": 478,
    "//github.com/digistump/digistumparduino/issues/16": 479,
    "minimize": 480,
    "size": 481,
    "non-pro": 482,
    "#if": 483,
    "!defined(arduino_avr_digisparkpro)": 484,
    "blynk_no_info": 485,
    "blynk_no_builtin": 486,
    "#endif": 487,
    "<digicdc.h>": 488,
    "serialusb.begin();": 489,
    "blynk.begin(serialusb": 490,
    "digistump_oak": 491,
    "digistump": 492,
    "oak": 493,
    "select": 494,
    "right": 495,
    "type": 496,
    "tools": 497,
    "->": 498,
    "menu!": 499,
    "has": 500,
    "already": 501,
    "configured": 502,
    "blynk.config(auth);": 503,
    "esp32_wifi": 504,
    "runs": 505,
    "directly": 506,
    "esp32": 507,
    "chip.": 508,
    "//github.com/espressif/arduino-esp32": 509,
    "module": 510,
    "<wificlient.h>": 511,
    "<blynksimpleesp32.h>": 512,
    "esp32_wifi_ssl": 513,
    "<wificlientsecure.h>": 514,
    "<blynksimpleesp32_ssl.h>": 515,
    "esp8266": 516,
    "yourwifi": 517,
    "wificlient": 518,
    "serial.println(ssid);": 519,
    "wifi.begin(ssid": 520,
    "(wifi.status()": 521,
    "!=": 522,
    "wl_connected)": 523,
    "delay(500);": 524,
    ".": 525,
    "serial.println();": 526,
    "connected": 527,
    "httprequest(const": 528,
    "string&": 529,
    "method": 530,
    "request": 531,
    "response)": 532,
    "serial.print(f(": 533,
    "));": 534,
    "serial.print(host);": 535,
    "serial.print(port);": 536,
    "...": 537,
    "(client.connect(host": 538,
    "port))": 539,
    "ok": 540,
    "else": 541,
    "failed": 542,
    "return": 543,
    "esp8266_shield": 544,
    "(with": 545,
    "at": 546,
    "commands)": 547,
    "warning!": 548,
    "very": 549,
    "tricky": 550,
    "working.": 551,
    "article": 552,
    "//help.blynk.cc/hardware-and-libraries/arduino/esp8266-with-at-firmware": 553,
    "<esp8266_lib.h>": 554,
    "<blynksimpleshieldesp8266.h>": 555,
    "esp8266_standalone": 556,
    "//github.com/esp8266/arduino": 557,
    "esp8266_standalone_manual_ip": 558,
    "mac": 559,
    "address": 560,
    "different": 561,
    "each": 562,
    "device": 563,
    "lan": 564,
    "arduino_mac[]": 565,
    "0xba": 566,
    "ipaddress": 567,
    "device_ip": 568,
    "(192": 569,
    "esp8266_standalone_ssl": 571,
    "<blynksimpleesp8266_ssl.h>": 572,
    "esp8266_standalone_smartconfig": 573,
    "smartconfig": 574,
    "might": 575,
    "environment.": 576,
    "try": 577,
    "basic": 578,
    "examples": 579,
    "before": 580,
    "using": 581,
    "sketch!": 582,
    "wifi.mode(wifi_sta);": 583,
    "cnt": 584,
    "0;": 585,
    "(cnt++": 586,
    ">=": 587,
    "10)": 588,
    "energia_serial_usb": 589,
    "energia": 590,
    "ide": 591,
    "//energia.nu/download/": 592,
    "energia_wifi": 593,
    "tested": 594,
    "ti": 595,
    "msp430f5529": 596,
    "+": 597,
    "cc3100": 598,
    "cc3200-launchxl": 599,
    "redbearlab": 600,
    "cc3200": 601,
    "mini": 602,
    "w/": 603,
    "micro": 604,
    "<blynksimpleenergiawifi.h>": 605,
    "fishino": 606,
    "software": 607,
    "libraries": 608,
    "//fishino.it/en/download/": 609,
    "<fishino.h>": 610,
    "<blynksimplefishino.h>": 611,
    "intel_edison_wifi": 612,
    "intel": 613,
    "edison": 614,
    "(wifi).": 615,
    "<blynksimpleinteledisonwifi.h>": 616,
    "one": 617,
    "of": 618,
    "those": 619,
    "commands": 620,
    "server_ip": 621,
    "port);": 622,
    "linkitone": 623,
    "<lwifi.h>": 624,
    "<lwificlient.h>": 625,
    "<blynksimplelinkitone.h>": 626,
    "choose": 627,
    "wifi_sec": 628,
    "lwifi_open": 629,
    "lwifi_wpa": 630,
    "lwifi_wep": 631,
    "lwifi_wpa;": 632,
    "wifi_sec);": 633,
    "nodemcu": 634,
    "nodemcu.": 635,
    "advanced": 636,
    "esp": 637,
    "-": 638,
    "esp8266_standalone_manual_ip.ino": 639,
    "esp8266_standalone_smartconfig.ino": 640,
    "esp8266_standalone_ssl.ino": 641,
    "rn_xv_wifly": 642,
    "wifly": 643,
    "rn-xv": 644,
    "wiflyhq": 645,
    "//github.com/harlequin-tech/wiflyhq": 646,
    "ensure": 647,
    "stable": 648,
    "connection!": 649,
    "4.41": 650,
    "<wiflyhq.h>": 651,
    "<blynksimplewifly.h>": 652,
    "redbear_duo_wifi": 653,
    "redbear": 654,
    "duo": 655,
    "<blynksimpleredbear_duo.h>": 656,
    "wpa2": 657,
    "wpa": 658,
    "wep": 659,
    "wpa2;": 660,
    "//system_mode(automatic);": 661,
    "system_mode(manual);": 662,
    "delay(5000);": 663,
    "wifi.on();": 664,
    "wifi.setcredentials(ssid": 665,
    "wifi.connect();": 666,
    "sim800_sim900": 667,
    "attention!": 668,
    "phone": 669,
    "sim": 670,
    "ballance": 671,
    "user": 672,
    "correct": 673,
    "internet": 674,
    "correctly": 675,
    "inserted": 676,
    "into": 677,
    "provide": 678,
    "good": 679,
    "power": 680,
    "supply": 681,
    "(up": 682,
    "2a)": 683,
    "(4.0-4.2v": 684,
    "5v": 685,
    "documentation)": 686,
    "4.": 687,
    "(hardware": 688,
    "recommended)": 689,
    "5.": 690,
    "antenna": 691,
    "attached": 692,
    "yourapn": 693,
    "gprs_user": 694,
    "uncomment": 695,
    "sparkfun_blynk_board": 696,
    "sparkfun": 697,
    "board.": 698,
    "1.0": 699,
    "(compatible": 700,
    "board)": 701,
    "menu": 702,
    "teensy3": 703,
    "template_esp32": 704,
    "demo.": 705,
    "only": 706,
    "development": 707,
    "testing.": 708,
    "setting.h": 709,
    "modify": 710,
    "general": 711,
    "options.": 712,
    "would": 713,
    "like": 714,
    "add": 715,
    "features": 716,
    "product": 717,
    "contact": 718,
    "businesses": 719,
    "//www.blynk.io/": 720,
    "//#define": 721,
    "use_wrover_board": 722,
    "use_custom_board": 723,
    "see": 724,
    "custom": 725,
    "configuration": 726,
    "settings.h": 727,
    "app_debug": 728,
    "blynkprovisioning.h": 729,
    "serial.begin(115200);": 730,
    "blynkprovisioning.begin();": 731,
    "handles": 732,
    "blynkprovisioning.run();": 733,
    "template_esp8266": 734,
    "use_sparkfun_blynk_board": 735,
    "use_node_mcu_board": 736,
    "use_witty_cloud_board": 737,
    "esp8266-based": 738,
    "template_mkr1000": 739,
    "some": 740,
    "additional": 741,
    "//github.com/cmaglie/flashstorage": 742,
    "//github.com/michael71/timer5": 743,
    "use_mkr1000_board": 744,
    "theairboard_wifly": 745,
    "airboard": 746,
    "//www.theairboard.cc/quick-start/": 747,
    "debugserial(10": 748,
    "11);": 749,
    "<theairboard.h>": 750,
    "tinyduino_wifi": 751,
    "tinycircuits": 752,
    "tools->board": 753,
    "pro": 754,
    "tools->processor": 755,
    "atmega": 756,
    "(3.3v": 758,
    "8mhz)": 759,
    "<blynksimpletinyduino.h>": 760,
    "wlan_sec_unsec": 761,
    "wlan_sec_wep": 762,
    "wlan_sec_wpa": 763,
    "wlan_sec_wpa2": 764,
    "wildfire_v3": 765,
    "wildfire": 766,
    "install": 767,
    "//shop.wickeddevice.com/resources/wildfire/": 768,
    "<wildfire.h>": 769,
    "<wildfire_cc3000.h>": 770,
    "<blynksimplewildfire.h>": 771,
    "wildfire;": 772,
    "wildfire_v4": 773,
    "v4": 774,
    "digital": 775,
    "used": 776,
    "reset/enable": 777,
    "wizfi310": 778,
    "//librarymanager/all#wizfi310": 779,
    "<wizfi310.h>": 780,
    "<blynksimplewizfi310.h>": 781,
    "chipkit_uno32": 782,
    "(rx)": 784,
    "(tx)": 786,
    "myplant_esp8266": 787,
    "demo": 788,
    "which": 789,
    "works": 790,
    "myplant": 791,
    "showcases": 792,
    "made": 793,
    "//itunes.apple.com/us/app/blynk-myplant/id1163620518": 794,
    "mt=8": 795,
    "//play.google.com/store/apps/details": 796,
    "id=cc.blynk.appexport.demo": 797,
    "/**************************************************************": 798,
    "*": 799,
    "workflow": 800,
    "network.": 801,
    "first": 802,
    "acts": 803,
    "as": 804,
    "access": 805,
    "point": 806,
    "broadcasts": 807,
    "own": 808,
    "wifi.": 809,
    "smartphone": 810,
    "connects": 811,
    "new": 812,
    "passes": 813,
    "together": 814,
    "saves": 815,
    "information": 816,
    "eeprom": 817,
    "reboots": 818,
    "now": 819
  }
}