{
  "vocabulary": [
    "<PAD>",
    "<START>",
    "<END>",
    "01helloworld",
    "gpio2led",
    "gpio2",
    "blynk_for_chinese",
    "httpsgithubcomhznupeterblynklibraryforchinese",
    "blynkhttpsgiteecomhznupeterblynk_iotwikis",
    "void",
    "setup",
    "pinmode2",
    "output",
    "loop",
    "digitalwrite2",
    "high",
    "02blynkblink",
    "io",
    "app",
    "buttongpio2switch",
    "define",
    "blynk_print",
    "serial",
    "include",
    "esp8266wifih",
    "blynksimpleesp8266h",
    "char",
    "auth",
    "c3102448027d494ca48b27d0a732f245",
    "ssid",
    "ssidwifi",
    "pass",
    "pssswordwifi",
    "serialbegin9600",
    "blynkbeginauth",
    "blynkcloudcom",
    "8080",
    "ipaddress192",
    "168",
    "1",
    "158",
    "8080ip",
    "blynkrun",
    "03getdata",
    "sliderv1",
    "2a365b624c0f4ea891256d4a66d428f7",
    "blynk_writev1",
    "int",
    "pinvalue",
    "paramasint",
    "v1",
    "string",
    "i",
    "paramasstr",
    "double",
    "d",
    "paramasdouble",
    "serialprintv1",
    "slider",
    "value",
    "is",
    "serialprintlnpinvalue",
    "04pushdata",
    "displayv5",
    "blynktimer",
    "timer",
    "mytimerevent",
    "10",
    "blynkvirtualwritev5",
    "millis",
    "1000",
    "timersetinterval1000l",
    "mytimerevent1000mytimerevent",
    "timerrun",
    "attiny85",
    "download",
    "latest",
    "blynk",
    "library",
    "here",
    "httpsgithubcomblynkkkblynklibraryreleaseslatest",
    "a",
    "platform",
    "with",
    "ios",
    "and",
    "android",
    "apps",
    "to",
    "control",
    "arduino",
    "raspberry",
    "pi",
    "the",
    "likes",
    "over",
    "internet",
    "you",
    "can",
    "easily",
    "build",
    "graphic",
    "interfaces",
    "for",
    "all",
    "your",
    "projects",
    "by",
    "simply",
    "dragging",
    "dropping",
    "widgets",
    "downloads",
    "docs",
    "tutorials",
    "httpwwwblynkcc",
    "sketch",
    "generator",
    "httpexamplesblynkcc",
    "community",
    "httpcommunityblynkcc",
    "follow",
    "us",
    "httpwwwfbcomblynkapp",
    "httptwittercomblynk_app",
    "licensed",
    "under",
    "mit",
    "license",
    "this",
    "example",
    "code",
    "in",
    "public",
    "domain",
    "usb",
    "howto",
    "httptinyccblynkusb",
    "note",
    "requires",
    "attiny",
    "support",
    "package",
    "httpsgithubcomdamellisattiny",
    "be",
    "sure",
    "check",
    "ordinary",
    "first",
    "a06",
    "5",
    "pb5",
    "8",
    "vcc",
    "a39",
    "3",
    "pb3",
    "2",
    "adafruit_feather_m0_wifi",
    "shows",
    "how",
    "use",
    "adafruit",
    "feather",
    "m0",
    "wifi",
    "connect",
    "project",
    "wifi101",
    "from",
    "httplibrarymanagerallwifi101",
    "feel",
    "free",
    "apply",
    "it",
    "any",
    "arduino_ethernet",
    "display",
    "widget",
    "on",
    "v2",
    "pins",
    "11",
    "12",
    "13",
    "are",
    "reserved",
    "ethernet",
    "module",
    "dont",
    "them",
    "directly",
    "warning",
    "if",
    "have",
    "an",
    "sd",
    "card",
    "may",
    "need",
    "disable",
    "arduino_gsm",
    "gsmh",
    "should",
    "get",
    "token",
    "go",
    "settings",
    "nut",
    "icon",
    "const",
    "yourauthtoken",
    "cloud",
    "server",
    "host",
    "unsigned",
    "port",
    "arduino_mkr1000",
    "mkr1000",
    "other",
    "arduino_mkr1010",
    "mkr",
    "1010",
    "wifinina",
    "httplibrarymanagerallwifinina",
    "arduino_serial_usb",
    "its",
    "simple",
    "comment",
    "out",
    "prints",
    "save",
    "space",
    "debugserial",
    "could",
    "arduino_softwareserial",
    "blynksimplestreamh",
    "softwareserialh",
    "arduino_wifi_shield",
    "shield",
    "please",
    "update",
    "firmware",
    "httpswwwarduinoccenhackingwifishieldfirmwareupgrading",
    "arduino_wifi_shield_101",
    "101",
    "arduino_yun",
    "yun",
    "bridge",
    "arduino_zero_m0_serial",
    "social",
    "networks",
    "serialusb",
    "arduino_org_uno_wifi",
    "arduinoorg",
    "uno",
    "link",
    "httplibrarymanagerallwifi_link",
    "blue_pill_stm32f103c",
    "stm32duino",
    "httpsgithubcomrogerclarkmelbournearduino_stm32wikiinstallation",
    "wait",
    "up",
    "30",
    "seconds",
    "after",
    "board",
    "starts",
    "allow",
    "initialize",
    "completely",
    "cc3000",
    "breakout",
    "adafruit_cc3000_library",
    "httpsgithubcomadafruitadafruit_cc3000_library",
    "version",
    "114",
    "or",
    "later",
    "digistump_digispark",
    "there",
    "issue",
    "linux",
    "httpsgithubcomdigistumpdigistumparduinoissues16",
    "minimize",
    "size",
    "nonpro",
    "definedarduino_avr_digisparkpro",
    "blynk_no_info",
    "blynk_no_builtin",
    "endif",
    "digicdch",
    "digistump_oak",
    "digistump",
    "oak",
    "select",
    "right",
    "type",
    "tools",
    "menu",
    "change",
    "run",
    "esp32_wifi",
    "runs",
    "esp32",
    "chip",
    "httpsgithubcomespressifarduinoesp32",
    "esp32_wifi_ssl",
    "esp8266",
    "network",
    "yourwifi",
    "yourpassword",
    "esp8266_shield",
    "at",
    "commands",
    "very",
    "tricky",
    "working",
    "read",
    "article",
    "httphelpblynkcchardwareandlibrariesarduinoesp8266withatfirmware",
    "esp8266_standalone",
    "httpsgithubcomesp8266arduino",
    "esp8266_standalone_manual_ip",
    "esp8266_standalone_ssl",
    "esp8266_standalone_smartconfig",
    "smartconfig",
    "energia_serial_usb",
    "energia",
    "ide",
    "httpenergianudownload",
    "serial1",
    "energia_wifi",
    "tested",
    "ti",
    "msp430f5529",
    "cc3100",
    "cc3200launchxl",
    "redbearlab",
    "cc3200",
    "mini",
    "w",
    "fishino",
    "software",
    "libraries",
    "httpfishinoitendownload",
    "intel_edison_wifi",
    "intel",
    "edison",
    "linkitone",
    "nodemcu",
    "advanced",
    "rn_xv_wifly",
    "wifly",
    "rnxv",
    "wiflyhq",
    "httpsgithubcomharlequintechwiflyhq",
    "ensure",
    "stable",
    "connection",
    "hardware",
    "redbear_duo_wifi",
    "redbear",
    "duo",
    "sim800_sim900",
    "attention",
    "using",
    "phone",
    "pin",
    "sim",
    "ballance",
    "that",
    "apnuserpass",
    "correct",
    "correctly",
    "inserted",
    "sparkfun_blynk_board",
    "sparkfun",
    "compatible",
    "teensy3",
    "template_esp32",
    "demo",
    "only",
    "development",
    "testing",
    "open",
    "settingh",
    "modify",
    "general",
    "options",
    "would",
    "like",
    "add",
    "these",
    "features",
    "product",
    "contact",
    "businesses",
    "httpwwwblynkio",
    "use_wrover_board",
    "use_custom_board",
    "see",
    "custom",
    "configuration",
    "settingsh",
    "app_debug",
    "debug",
    "blynkprovisioningh",
    "delay500",
    "serialbegin115200",
    "blynkprovisioningbegin",
    "handles",
    "blynkprovisioningrun",
    "template_esp8266",
    "use_sparkfun_blynk_board",
    "uncomment",
    "use_node_mcu_board",
    "boards",
    "not",
    "use_witty_cloud_board",
    "esp8266based",
    "template_mkr1000",
    "some",
    "additional",
    "httpsgithubcomcmaglieflashstorage",
    "httpsgithubcommichael71timer5",
    "use_mkr1000_board",
    "theairboard_wifly",
    "airboard",
    "tinyduino_wifi",
    "tinycircuits",
    "preferred",
    "toolsboard",
    "pro",
    "wildfire_v3",
    "wildfire",
    "install",
    "httpshopwickeddevicecomresourceswildfire",
    "wildfire_v4",
    "v4",
    "wizfi310",
    "httplibrarymanagerallwizfi310",
    "chipkit_uno32",
    "myplant_esp8266",
    "which",
    "works",
    "myplant",
    "showcases",
    "made",
    "work",
    "httpsitunesapplecomusappblynkmyplantid1163620518mt8",
    "httpsplaygooglecomstoreappsdetailsidccblynkappexportdemo",
    "workflow"
  ],
  "total_tokens": 453,
  "tokenToIndex": {
    "1": 39,
    "2": 157,
    "3": 155,
    "5": 150,
    "8": 152,
    "10": 67,
    "11": 182,
    "12": 183,
    "13": 184,
    "30": 263,
    "101": 245,
    "114": 276,
    "158": 40,
    "168": 38,
    "1000": 70,
    "1010": 222,
    "8080": 36,
    "<PAD>": 0,
    "<START>": 1,
    "<END>": 2,
    "01helloworld": 3,
    "gpio2led": 4,
    "gpio2": 5,
    "blynk_for_chinese": 6,
    "httpsgithubcomhznupeterblynklibraryforchinese": 7,
    "blynkhttpsgiteecomhznupeterblynk_iotwikis": 8,
    "void": 9,
    "setup": 10,
    "pinmode2": 11,
    "output": 12,
    "loop": 13,
    "digitalwrite2": 14,
    "high": 15,
    "02blynkblink": 16,
    "io": 17,
    "app": 18,
    "buttongpio2switch": 19,
    "define": 20,
    "blynk_print": 21,
    "serial": 22,
    "include": 23,
    "esp8266wifih": 24,
    "blynksimpleesp8266h": 25,
    "char": 26,
    "auth": 27,
    "c3102448027d494ca48b27d0a732f245": 28,
    "ssid": 29,
    "ssidwifi": 30,
    "pass": 31,
    "pssswordwifi": 32,
    "serialbegin9600": 33,
    "blynkbeginauth": 34,
    "blynkcloudcom": 35,
    "ipaddress192": 37,
    "8080ip": 41,
    "blynkrun": 42,
    "03getdata": 43,
    "sliderv1": 44,
    "2a365b624c0f4ea891256d4a66d428f7": 45,
    "blynk_writev1": 46,
    "int": 47,
    "pinvalue": 48,
    "paramasint": 49,
    "v1": 50,
    "string": 51,
    "i": 52,
    "paramasstr": 53,
    "double": 54,
    "d": 55,
    "paramasdouble": 56,
    "serialprintv1": 57,
    "slider": 58,
    "value": 59,
    "is": 60,
    "serialprintlnpinvalue": 61,
    "04pushdata": 62,
    "displayv5": 63,
    "blynktimer": 64,
    "timer": 65,
    "mytimerevent": 66,
    "blynkvirtualwritev5": 68,
    "millis": 69,
    "timersetinterval1000l": 71,
    "mytimerevent1000mytimerevent": 72,
    "timerrun": 73,
    "attiny85": 74,
    "download": 75,
    "latest": 76,
    "blynk": 77,
    "library": 78,
    "here": 79,
    "httpsgithubcomblynkkkblynklibraryreleaseslatest": 80,
    "a": 81,
    "platform": 82,
    "with": 83,
    "ios": 84,
    "and": 85,
    "android": 86,
    "apps": 87,
    "to": 88,
    "control": 89,
    "arduino": 90,
    "raspberry": 91,
    "pi": 92,
    "the": 93,
    "likes": 94,
    "over": 95,
    "internet": 96,
    "you": 97,
    "can": 98,
    "easily": 99,
    "build": 100,
    "graphic": 101,
    "interfaces": 102,
    "for": 103,
    "all": 104,
    "your": 105,
    "projects": 106,
    "by": 107,
    "simply": 108,
    "dragging": 109,
    "dropping": 110,
    "widgets": 111,
    "downloads": 112,
    "docs": 113,
    "tutorials": 114,
    "httpwwwblynkcc": 115,
    "sketch": 116,
    "generator": 117,
    "httpexamplesblynkcc": 118,
    "community": 119,
    "httpcommunityblynkcc": 120,
    "follow": 121,
    "us": 122,
    "httpwwwfbcomblynkapp": 123,
    "httptwittercomblynk_app": 124,
    "licensed": 125,
    "under": 126,
    "mit": 127,
    "license": 128,
    "this": 129,
    "example": 130,
    "code": 131,
    "in": 132,
    "public": 133,
    "domain": 134,
    "usb": 135,
    "howto": 136,
    "httptinyccblynkusb": 137,
    "note": 138,
    "requires": 139,
    "attiny": 140,
    "support": 141,
    "package": 142,
    "httpsgithubcomdamellisattiny": 143,
    "be": 144,
    "sure": 145,
    "check": 146,
    "ordinary": 147,
    "first": 148,
    "a06": 149,
    "pb5": 151,
    "vcc": 153,
    "a39": 154,
    "pb3": 156,
    "adafruit_feather_m0_wifi": 158,
    "shows": 159,
    "how": 160,
    "use": 161,
    "adafruit": 162,
    "feather": 163,
    "m0": 164,
    "wifi": 165,
    "connect": 166,
    "project": 167,
    "wifi101": 168,
    "from": 169,
    "httplibrarymanagerallwifi101": 170,
    "feel": 171,
    "free": 172,
    "apply": 173,
    "it": 174,
    "any": 175,
    "arduino_ethernet": 176,
    "display": 177,
    "widget": 178,
    "on": 179,
    "v2": 180,
    "pins": 181,
    "are": 185,
    "reserved": 186,
    "ethernet": 187,
    "module": 188,
    "dont": 189,
    "them": 190,
    "directly": 191,
    "warning": 192,
    "if": 193,
    "have": 194,
    "an": 195,
    "sd": 196,
    "card": 197,
    "may": 198,
    "need": 199,
    "disable": 200,
    "arduino_gsm": 201,
    "gsmh": 202,
    "should": 203,
    "get": 204,
    "token": 205,
    "go": 206,
    "settings": 207,
    "nut": 208,
    "icon": 209,
    "const": 210,
    "yourauthtoken": 211,
    "cloud": 212,
    "server": 213,
    "host": 214,
    "unsigned": 215,
    "port": 216,
    "arduino_mkr1000": 217,
    "mkr1000": 218,
    "other": 219,
    "arduino_mkr1010": 220,
    "mkr": 221,
    "wifinina": 223,
    "httplibrarymanagerallwifinina": 224,
    "arduino_serial_usb": 225,
    "its": 226,
    "simple": 227,
    "comment": 228,
    "out": 229,
    "prints": 230,
    "save": 231,
    "space": 232,
    "debugserial": 233,
    "could": 234,
    "arduino_softwareserial": 235,
    "blynksimplestreamh": 236,
    "softwareserialh": 237,
    "arduino_wifi_shield": 238,
    "shield": 239,
    "please": 240,
    "update": 241,
    "firmware": 242,
    "httpswwwarduinoccenhackingwifishieldfirmwareupgrading": 243,
    "arduino_wifi_shield_101": 244,
    "arduino_yun": 246,
    "yun": 247,
    "bridge": 248,
    "arduino_zero_m0_serial": 249,
    "social": 250,
    "networks": 251,
    "serialusb": 252,
    "arduino_org_uno_wifi": 253,
    "arduinoorg": 254,
    "uno": 255,
    "link": 256,
    "httplibrarymanagerallwifi_link": 257,
    "blue_pill_stm32f103c": 258,
    "stm32duino": 259,
    "httpsgithubcomrogerclarkmelbournearduino_stm32wikiinstallation": 260,
    "wait": 261,
    "up": 262,
    "seconds": 264,
    "after": 265,
    "board": 266,
    "starts": 267,
    "allow": 268,
    "initialize": 269,
    "completely": 270,
    "cc3000": 271,
    "breakout": 272,
    "adafruit_cc3000_library": 273,
    "httpsgithubcomadafruitadafruit_cc3000_library": 274,
    "version": 275,
    "or": 277,
    "later": 278,
    "digistump_digispark": 279,
    "there": 280,
    "issue": 281,
    "linux": 282,
    "httpsgithubcomdigistumpdigistumparduinoissues16": 283,
    "minimize": 284,
    "size": 285,
    "nonpro": 286,
    "definedarduino_avr_digisparkpro": 287,
    "blynk_no_info": 288,
    "blynk_no_builtin": 289,
    "endif": 290,
    "digicdch": 291,
    "digistump_oak": 292,
    "digistump": 293,
    "oak": 294,
    "select": 295,
    "right": 296,
    "type": 297,
    "tools": 298,
    "menu": 299,
    "change": 300,
    "run": 301,
    "esp32_wifi": 302,
    "runs": 303,
    "esp32": 304,
    "chip": 305,
    "httpsgithubcomespressifarduinoesp32": 306,
    "esp32_wifi_ssl": 307,
    "esp8266": 308,
    "network": 309,
    "yourwifi": 310,
    "yourpassword": 311,
    "esp8266_shield": 312,
    "at": 313,
    "commands": 314,
    "very": 315,
    "tricky": 316,
    "working": 317,
    "read": 318,
    "article": 319,
    "httphelpblynkcchardwareandlibrariesarduinoesp8266withatfirmware": 320,
    "esp8266_standalone": 321,
    "httpsgithubcomesp8266arduino": 322,
    "esp8266_standalone_manual_ip": 323,
    "esp8266_standalone_ssl": 324,
    "esp8266_standalone_smartconfig": 325,
    "smartconfig": 326,
    "energia_serial_usb": 327,
    "energia": 328,
    "ide": 329,
    "httpenergianudownload": 330,
    "serial1": 331,
    "energia_wifi": 332,
    "tested": 333,
    "ti": 334,
    "msp430f5529": 335,
    "cc3100": 336,
    "cc3200launchxl": 337,
    "redbearlab": 338,
    "cc3200": 339,
    "mini": 340,
    "w": 341,
    "fishino": 342,
    "software": 343,
    "libraries": 344,
    "httpfishinoitendownload": 345,
    "intel_edison_wifi": 346,
    "intel": 347,
    "edison": 348,
    "linkitone": 349,
    "nodemcu": 350,
    "advanced": 351,
    "rn_xv_wifly": 352,
    "wifly": 353,
    "rnxv": 354,
    "wiflyhq": 355,
    "httpsgithubcomharlequintechwiflyhq": 356,
    "ensure": 357,
    "stable": 358,
    "connection": 359,
    "hardware": 360,
    "redbear_duo_wifi": 361,
    "redbear": 362,
    "duo": 363,
    "sim800_sim900": 364,
    "attention": 365,
    "using": 366,
    "phone": 367,
    "pin": 368,
    "sim": 369,
    "ballance": 370,
    "that": 371,
    "apnuserpass": 372,
    "correct": 373,
    "correctly": 374,
    "inserted": 375,
    "sparkfun_blynk_board": 376,
    "sparkfun": 377,
    "compatible": 378,
    "teensy3": 379,
    "template_esp32": 380,
    "demo": 381,
    "only": 382,
    "development": 383,
    "testing": 384,
    "open": 385,
    "settingh": 386,
    "modify": 387,
    "general": 388,
    "options": 389,
    "would": 390,
    "like": 391,
    "add": 392,
    "these": 393,
    "features": 394,
    "product": 395,
    "contact": 396,
    "businesses": 397,
    "httpwwwblynkio": 398,
    "use_wrover_board": 399,
    "use_custom_board": 400,
    "see": 401,
    "custom": 402,
    "configuration": 403,
    "settingsh": 404,
    "app_debug": 405,
    "debug": 406,
    "blynkprovisioningh": 407,
    "delay500": 408,
    "serialbegin115200": 409,
    "blynkprovisioningbegin": 410,
    "handles": 411,
    "blynkprovisioningrun": 412,
    "template_esp8266": 413,
    "use_sparkfun_blynk_board": 414,
    "uncomment": 415,
    "use_node_mcu_board": 416,
    "boards": 417,
    "not": 418,
    "use_witty_cloud_board": 419,
    "esp8266based": 420,
    "template_mkr1000": 421,
    "some": 422,
    "additional": 423,
    "httpsgithubcomcmaglieflashstorage": 424,
    "httpsgithubcommichael71timer5": 425,
    "use_mkr1000_board": 426,
    "theairboard_wifly": 427,
    "airboard": 428,
    "tinyduino_wifi": 429,
    "tinycircuits": 430,
    "preferred": 431,
    "toolsboard": 432,
    "pro": 433,
    "wildfire_v3": 434,
    "wildfire": 435,
    "install": 436,
    "httpshopwickeddevicecomresourceswildfire": 437,
    "wildfire_v4": 438,
    "v4": 439,
    "wizfi310": 440,
    "httplibrarymanagerallwizfi310": 441,
    "chipkit_uno32": 442,
    "myplant_esp8266": 443,
    "which": 444,
    "works": 445,
    "myplant": 446,
    "showcases": 447,
    "made": 448,
    "work": 449,
    "httpsitunesapplecomusappblynkmyplantid1163620518mt8": 450,
    "httpsplaygooglecomstoreappsdetailsidccblynkappexportdemo": 451,
    "workflow": 452
  }
}