{
  "vocabulary": [
    "<PAD>",
    "<START>",
    "<END>",
    "01helloworld",
    "/*************************************************************",
    "gpio2led",
    "gpio2",
    "blynk_for_chinese",
    "https",
    "//github.com/hznupeter/blynk-library-for-chinese",
    "blynk",
    "//gitee.com/hznupeter/blynk_iot/wikis",
    "*************************************************************/",
    "void",
    "setup()",
    "{",
    "pinmode(2",
    "output);",
    "}",
    "loop()",
    "digitalwrite(2",
    "high);",
    "02blynkblink",
    "io",
    "app",
    "button",
    "switch",
    "define",
    "blynk_print",
    "serial",
    "//",
    "include",
    "<esp8266wifi.h>",
    "<blynksimpleesp8266.h>",
    "char",
    "auth[]",
    "=",
    "c3102448027d494ca48b27d0a732f245",
    ";//",
    "ssid[]",
    "ssid",
    ";//wifi",
    "pass[]",
    "psssword",
    "serial.begin(9600);",
    "blynk.begin(auth",
    "pass);//",
    "//blynk.begin(auth",
    "pass",
    "blynk-cloud.com",
    "8080);//",
    "ipaddress(192",
    "168",
    "1",
    "158)",
    "ip",
    "blynk.run();",
    "03getdata",
    "slider",
    "v1",
    "2a365b624c0f4ea891256d4a66d428f7",
    "blynk_write(v1)",
    "int",
    "pinvalue",
    "param.asint();",
    "string",
    "i",
    "param.asstr();",
    "double",
    "d",
    "param.asdouble();",
    "serial.print(",
    "value",
    "is",
    ");",
    "serial.println(pinvalue);",
    "04pushdata",
    "display",
    "v5",
    "blynktimer",
    "timer;",
    "mytimerevent()",
    "10",
    "blynk.virtualwrite(v5",
    "millis()",
    "/",
    "1000);",
    "timer.setinterval(1000l",
    "mytimerevent);//",
    "1000",
    "mytimerevent",
    "timer.run();",
    "attiny85",
    "download",
    "latest",
    "library",
    "here",
    "//github.com/blynkkk/blynk-library/releases/latest",
    "a",
    "platform",
    "with",
    "ios",
    "and",
    "android",
    "apps",
    "to",
    "control",
    "arduino",
    "raspberry",
    "pi",
    "the",
    "likes",
    "over",
    "internet.",
    "you",
    "can",
    "easily",
    "build",
    "graphic",
    "interfaces",
    "for",
    "all",
    "your",
    "projects",
    "by",
    "simply",
    "dragging",
    "dropping",
    "widgets.",
    "downloads",
    "docs",
    "tutorials",
    "http",
    "//www.blynk.cc",
    "sketch",
    "generator",
    "//examples.blynk.cc",
    "community",
    "//community.blynk.cc",
    "follow",
    "us",
    "//www.fb.com/blynkapp",
    "//twitter.com/blynk_app",
    "licensed",
    "under",
    "mit",
    "license",
    "this",
    "example",
    "code",
    "in",
    "public",
    "domain.",
    "*************************************************************",
    "=>",
    "usb",
    "howto",
    "//tiny.cc/blynkusb",
    "note",
    "requires",
    "attiny",
    "support",
    "package",
    "//github.com/damellis/attiny",
    "be",
    "sure",
    "check",
    "ordinary",
    "adafruit_feather_m0_wifi",
    "shows",
    "how",
    "use",
    "adafruit",
    "feather",
    "m0",
    "wifi",
    "connect",
    "project",
    "blynk.",
    "wifi101",
    "from",
    "arduino_ethernet",
    "setup",
    "widget",
    "on",
    "v2",
    "pins",
    "11",
    "12",
    "13",
    "are",
    "reserved",
    "ethernet",
    "module.",
    "don",
    "t",
    "them",
    "directly!",
    "warning",
    "if",
    "have",
    "an",
    "arduino_gsm",
    "<gsm.h>",
    "should",
    "get",
    "auth",
    "token",
    "app.",
    "go",
    "settings",
    "(nut",
    "icon).",
    "const",
    "arduino_mkr1000",
    "mkr1000",
    "//librarymanager/all",
    "arduino_mkr1010",
    "mkr",
    "1010",
    "wifinina",
    "arduino_serial_usb",
    "feel",
    "free",
    "apply",
    "it",
    "any",
    "other",
    "example.",
    "s",
    "simple!",
    "/*",
    "comment",
    "arduino_softwareserial",
    "arduino_wifi_shield",
    "shield",
    "please",
    "update",
    "firmware",
    "//www.arduino.cc/en/hacking/wifishieldfirmwareupgrading",
    "arduino_wifi_shield_101",
    "101",
    "arduino_yun",
    "yun",
    "bridge",
    "arduino_zero_m0_serial",
    "social",
    "networks",
    "arduino_org_uno_wifi",
    "arduino.org",
    "uno",
    "link",
    "blue_pill_stm32f103c",
    "stm32duino",
    "//github.com/rogerclarkmelbourne/arduino_stm32/wiki/installation",
    "may",
    "need",
    "wait",
    "up",
    "cc3000",
    "breakout",
    "adafruit_cc3000_library",
    "digistump_digispark",
    "there",
    "issue",
    "linux",
    "//github.com/digistump/digistumparduino/issues/16",
    "minimize",
    "size",
    "non-pro",
    "digistump_oak",
    "digistump",
    "oak",
    "select",
    "right",
    "board",
    "type",
    "tools",
    "esp32_wifi",
    "runs",
    "directly",
    "esp32",
    "chip.",
    "//github.com/espressif/arduino-esp32",
    "esp32_wifi_ssl",
    "esp8266",
    "esp8266_shield",
    "(with",
    "at",
    "commands)",
    "warning!",
    "very",
    "tricky",
    "esp8266_standalone",
    "//github.com/esp8266/arduino",
    "esp8266_standalone_manual_ip",
    "esp8266_standalone_ssl",
    "esp8266_standalone_smartconfig",
    "energia_serial_usb",
    "energia",
    "ide",
    "//energia.nu/download/",
    "energia_wifi",
    "tested",
    "ti",
    "msp430f5529",
    "+",
    "cc3100",
    "fishino",
    "software",
    "libraries",
    "//fishino.it/en/download/",
    "change",
    "intel_edison_wifi",
    "intel",
    "edison",
    "(wifi).",
    "linkitone",
    "nodemcu",
    "nodemcu.",
    "rn_xv_wifly",
    "wifly",
    "rn-xv",
    "wiflyhq",
    "redbear_duo_wifi",
    "redbear",
    "duo",
    "sim800_sim900",
    "attention!",
    "1.",
    "using",
    "phone",
    "disable",
    "pin",
    "sim",
    "card",
    "ballance",
    "that",
    "apn",
    "user",
    "correct",
    "sparkfun_blynk_board",
    "sparkfun",
    "board.",
    "1.0",
    "(compatible",
    "board)",
    "teensy3",
    "template_esp32",
    "demo.",
    "only",
    "development",
    "testing.",
    "open",
    "setting.h",
    "modify",
    "general",
    "options.",
    "would",
    "like",
    "add",
    "these",
    "features",
    "product",
    "contact",
    "businesses",
    "//www.blynk.io/",
    "use_wrover_board",
    "use_custom_board",
    "see",
    "custom",
    "configuration",
    "settings.h",
    "app_debug",
    "out",
    "debug",
    "prints",
    "blynkprovisioning.h",
    "delay(500);",
    "serial.begin(115200);",
    "blynkprovisioning.begin();",
    "handles",
    "network",
    "cloud",
    "connection",
    "blynkprovisioning.run();",
    "template_esp8266",
    "use_sparkfun_blynk_board",
    "uncomment",
    "use_node_mcu_board",
    "boards",
    "not",
    "use_witty_cloud_board",
    "esp8266-based",
    "-",
    "template_mkr1000",
    "some",
    "additional",
    "//github.com/cmaglie/flashstorage",
    "//github.com/michael71/timer5",
    "use_mkr1000_board",
    "theairboard_wifly",
    "airboard",
    "module",
    "tinyduino_wifi",
    "tinycircuits",
    "version",
    "1.14",
    "or",
    "later",
    "wildfire_v3",
    "wildfire",
    "install",
    "wildfire_v4",
    "v4",
    "wizfi310",
    "chipkit_uno32",
    "myplant_esp8266",
    "demo",
    "which",
    "works",
    "myplant",
    "showcases",
    "made",
    "work",
    "//itunes.apple.com/us/app/blynk-myplant/id1163620518",
    "mt=8",
    "//play.google.com/store/apps/details",
    "id=cc.blynk.appexport.demo"
  ],
  "total_tokens": 429,
  "tokenToIndex": {
    "1": 53,
    "10": 82,
    "11": 187,
    "12": 188,
    "13": 189,
    "101": 241,
    "168": 52,
    "1000": 89,
    "1010": 219,
    "<PAD>": 0,
    "<START>": 1,
    "<END>": 2,
    "01helloworld": 3,
    "/*************************************************************": 4,
    "gpio2led": 5,
    "gpio2": 6,
    "blynk_for_chinese": 7,
    "https": 8,
    "//github.com/hznupeter/blynk-library-for-chinese": 9,
    "blynk": 10,
    "//gitee.com/hznupeter/blynk_iot/wikis": 11,
    "*************************************************************/": 12,
    "void": 13,
    "setup()": 14,
    "{": 15,
    "pinmode(2": 16,
    "output);": 17,
    "}": 18,
    "loop()": 19,
    "digitalwrite(2": 20,
    "high);": 21,
    "02blynkblink": 22,
    "io": 23,
    "app": 24,
    "button": 25,
    "switch": 26,
    "define": 27,
    "blynk_print": 28,
    "serial": 29,
    "//": 30,
    "include": 31,
    "<esp8266wifi.h>": 32,
    "<blynksimpleesp8266.h>": 33,
    "char": 34,
    "auth[]": 35,
    "=": 36,
    "c3102448027d494ca48b27d0a732f245": 37,
    ";//": 38,
    "ssid[]": 39,
    "ssid": 40,
    ";//wifi": 41,
    "pass[]": 42,
    "psssword": 43,
    "serial.begin(9600);": 44,
    "blynk.begin(auth": 45,
    "pass);//": 46,
    "//blynk.begin(auth": 47,
    "pass": 48,
    "blynk-cloud.com": 49,
    "8080);//": 50,
    "ipaddress(192": 51,
    "158)": 54,
    "ip": 55,
    "blynk.run();": 56,
    "03getdata": 57,
    "slider": 58,
    "v1": 59,
    "2a365b624c0f4ea891256d4a66d428f7": 60,
    "blynk_write(v1)": 61,
    "int": 62,
    "pinvalue": 63,
    "param.asint();": 64,
    "string": 65,
    "i": 66,
    "param.asstr();": 67,
    "double": 68,
    "d": 69,
    "param.asdouble();": 70,
    "serial.print(": 71,
    "value": 72,
    "is": 73,
    ");": 74,
    "serial.println(pinvalue);": 75,
    "04pushdata": 76,
    "display": 77,
    "v5": 78,
    "blynktimer": 79,
    "timer;": 80,
    "mytimerevent()": 81,
    "blynk.virtualwrite(v5": 83,
    "millis()": 84,
    "/": 85,
    "1000);": 86,
    "timer.setinterval(1000l": 87,
    "mytimerevent);//": 88,
    "mytimerevent": 90,
    "timer.run();": 91,
    "attiny85": 92,
    "download": 93,
    "latest": 94,
    "library": 95,
    "here": 96,
    "//github.com/blynkkk/blynk-library/releases/latest": 97,
    "a": 98,
    "platform": 99,
    "with": 100,
    "ios": 101,
    "and": 102,
    "android": 103,
    "apps": 104,
    "to": 105,
    "control": 106,
    "arduino": 107,
    "raspberry": 108,
    "pi": 109,
    "the": 110,
    "likes": 111,
    "over": 112,
    "internet.": 113,
    "you": 114,
    "can": 115,
    "easily": 116,
    "build": 117,
    "graphic": 118,
    "interfaces": 119,
    "for": 120,
    "all": 121,
    "your": 122,
    "projects": 123,
    "by": 124,
    "simply": 125,
    "dragging": 126,
    "dropping": 127,
    "widgets.": 128,
    "downloads": 129,
    "docs": 130,
    "tutorials": 131,
    "http": 132,
    "//www.blynk.cc": 133,
    "sketch": 134,
    "generator": 135,
    "//examples.blynk.cc": 136,
    "community": 137,
    "//community.blynk.cc": 138,
    "follow": 139,
    "us": 140,
    "//www.fb.com/blynkapp": 141,
    "//twitter.com/blynk_app": 142,
    "licensed": 143,
    "under": 144,
    "mit": 145,
    "license": 146,
    "this": 147,
    "example": 148,
    "code": 149,
    "in": 150,
    "public": 151,
    "domain.": 152,
    "*************************************************************": 153,
    "=>": 154,
    "usb": 155,
    "howto": 156,
    "//tiny.cc/blynkusb": 157,
    "note": 158,
    "requires": 159,
    "attiny": 160,
    "support": 161,
    "package": 162,
    "//github.com/damellis/attiny": 163,
    "be": 164,
    "sure": 165,
    "check": 166,
    "ordinary": 167,
    "adafruit_feather_m0_wifi": 168,
    "shows": 169,
    "how": 170,
    "use": 171,
    "adafruit": 172,
    "feather": 173,
    "m0": 174,
    "wifi": 175,
    "connect": 176,
    "project": 177,
    "blynk.": 178,
    "wifi101": 179,
    "from": 180,
    "arduino_ethernet": 181,
    "setup": 182,
    "widget": 183,
    "on": 184,
    "v2": 185,
    "pins": 186,
    "are": 190,
    "reserved": 191,
    "ethernet": 192,
    "module.": 193,
    "don": 194,
    "t": 195,
    "them": 196,
    "directly!": 197,
    "warning": 198,
    "if": 199,
    "have": 200,
    "an": 201,
    "arduino_gsm": 202,
    "<gsm.h>": 203,
    "should": 204,
    "get": 205,
    "auth": 206,
    "token": 207,
    "app.": 208,
    "go": 209,
    "settings": 210,
    "(nut": 211,
    "icon).": 212,
    "const": 213,
    "arduino_mkr1000": 214,
    "mkr1000": 215,
    "//librarymanager/all": 216,
    "arduino_mkr1010": 217,
    "mkr": 218,
    "wifinina": 220,
    "arduino_serial_usb": 221,
    "feel": 222,
    "free": 223,
    "apply": 224,
    "it": 225,
    "any": 226,
    "other": 227,
    "example.": 228,
    "s": 229,
    "simple!": 230,
    "/*": 231,
    "comment": 232,
    "arduino_softwareserial": 233,
    "arduino_wifi_shield": 234,
    "shield": 235,
    "please": 236,
    "update": 237,
    "firmware": 238,
    "//www.arduino.cc/en/hacking/wifishieldfirmwareupgrading": 239,
    "arduino_wifi_shield_101": 240,
    "arduino_yun": 242,
    "yun": 243,
    "bridge": 244,
    "arduino_zero_m0_serial": 245,
    "social": 246,
    "networks": 247,
    "arduino_org_uno_wifi": 248,
    "arduino.org": 249,
    "uno": 250,
    "link": 251,
    "blue_pill_stm32f103c": 252,
    "stm32duino": 253,
    "//github.com/rogerclarkmelbourne/arduino_stm32/wiki/installation": 254,
    "may": 255,
    "need": 256,
    "wait": 257,
    "up": 258,
    "cc3000": 259,
    "breakout": 260,
    "adafruit_cc3000_library": 261,
    "digistump_digispark": 262,
    "there": 263,
    "issue": 264,
    "linux": 265,
    "//github.com/digistump/digistumparduino/issues/16": 266,
    "minimize": 267,
    "size": 268,
    "non-pro": 269,
    "digistump_oak": 270,
    "digistump": 271,
    "oak": 272,
    "select": 273,
    "right": 274,
    "board": 275,
    "type": 276,
    "tools": 277,
    "esp32_wifi": 278,
    "runs": 279,
    "directly": 280,
    "esp32": 281,
    "chip.": 282,
    "//github.com/espressif/arduino-esp32": 283,
    "esp32_wifi_ssl": 284,
    "esp8266": 285,
    "esp8266_shield": 286,
    "(with": 287,
    "at": 288,
    "commands)": 289,
    "warning!": 290,
    "very": 291,
    "tricky": 292,
    "esp8266_standalone": 293,
    "//github.com/esp8266/arduino": 294,
    "esp8266_standalone_manual_ip": 295,
    "esp8266_standalone_ssl": 296,
    "esp8266_standalone_smartconfig": 297,
    "energia_serial_usb": 298,
    "energia": 299,
    "ide": 300,
    "//energia.nu/download/": 301,
    "energia_wifi": 302,
    "tested": 303,
    "ti": 304,
    "msp430f5529": 305,
    "+": 306,
    "cc3100": 307,
    "fishino": 308,
    "software": 309,
    "libraries": 310,
    "//fishino.it/en/download/": 311,
    "change": 312,
    "intel_edison_wifi": 313,
    "intel": 314,
    "edison": 315,
    "(wifi).": 316,
    "linkitone": 317,
    "nodemcu": 318,
    "nodemcu.": 319,
    "rn_xv_wifly": 320,
    "wifly": 321,
    "rn-xv": 322,
    "wiflyhq": 323,
    "redbear_duo_wifi": 324,
    "redbear": 325,
    "duo": 326,
    "sim800_sim900": 327,
    "attention!": 328,
    "1.": 329,
    "using": 330,
    "phone": 331,
    "disable": 332,
    "pin": 333,
    "sim": 334,
    "card": 335,
    "ballance": 336,
    "that": 337,
    "apn": 338,
    "user": 339,
    "correct": 340,
    "sparkfun_blynk_board": 341,
    "sparkfun": 342,
    "board.": 343,
    "1.0": 344,
    "(compatible": 345,
    "board)": 346,
    "teensy3": 347,
    "template_esp32": 348,
    "demo.": 349,
    "only": 350,
    "development": 351,
    "testing.": 352,
    "open": 353,
    "setting.h": 354,
    "modify": 355,
    "general": 356,
    "options.": 357,
    "would": 358,
    "like": 359,
    "add": 360,
    "these": 361,
    "features": 362,
    "product": 363,
    "contact": 364,
    "businesses": 365,
    "//www.blynk.io/": 366,
    "use_wrover_board": 367,
    "use_custom_board": 368,
    "see": 369,
    "custom": 370,
    "configuration": 371,
    "settings.h": 372,
    "app_debug": 373,
    "out": 374,
    "debug": 375,
    "prints": 376,
    "blynkprovisioning.h": 377,
    "delay(500);": 378,
    "serial.begin(115200);": 379,
    "blynkprovisioning.begin();": 380,
    "handles": 381,
    "network": 382,
    "cloud": 383,
    "connection": 384,
    "blynkprovisioning.run();": 385,
    "template_esp8266": 386,
    "use_sparkfun_blynk_board": 387,
    "uncomment": 388,
    "use_node_mcu_board": 389,
    "boards": 390,
    "not": 391,
    "use_witty_cloud_board": 392,
    "esp8266-based": 393,
    "-": 394,
    "template_mkr1000": 395,
    "some": 396,
    "additional": 397,
    "//github.com/cmaglie/flashstorage": 398,
    "//github.com/michael71/timer5": 399,
    "use_mkr1000_board": 400,
    "theairboard_wifly": 401,
    "airboard": 402,
    "module": 403,
    "tinyduino_wifi": 404,
    "tinycircuits": 405,
    "version": 406,
    "1.14": 407,
    "or": 408,
    "later": 409,
    "wildfire_v3": 410,
    "wildfire": 411,
    "install": 412,
    "wildfire_v4": 413,
    "v4": 414,
    "wizfi310": 415,
    "chipkit_uno32": 416,
    "myplant_esp8266": 417,
    "demo": 418,
    "which": 419,
    "works": 420,
    "myplant": 421,
    "showcases": 422,
    "made": 423,
    "work": 424,
    "//itunes.apple.com/us/app/blynk-myplant/id1163620518": 425,
    "mt=8": 426,
    "//play.google.com/store/apps/details": 427,
    "id=cc.blynk.appexport.demo": 428
  }
}